[1,0,0,[["cc.JsonAsset",["_name","json"],1]],[[0,0,1,3]],[[0,"FoodRecipes",[["Id","RawMaterial","Practice"],["编号","原材料","做法"],[601,"1.2 kg of freshly ground chuck\n1 tbsp of onion powder\n1 tsp salt\n1 tsp freshly ground black pepper\n12 slices of American cheese\n6 large burger buns, preferably homemade\n\nGARNISH\nlettuce\nonions, sliced\ntomatoes, sliced\nketchup\npickles, sliced","1. In a large bowl gently mix ground beef and onion powder, then shape into six patties that are slightly larger than your hamburger buns and have a dent in the center.\n2. Heat your grill, grill pan, or a cast iron skillet over high heat, season the patties liberally with salt and pepper, then place them on the grill to cook.\n3. Cook for about two minutes until the crust on the bottom has formed. Flip the burgers once you can lift them up easily then add two cheese slices to each. Cook for another two to three minutes.\n4. Remove from the grill and transfer into buns, add the desired garnishings and condiments like lettuce, onions, tomatoes, and ketchup, then serve."],[602,"Chicken patties\n4 1/2-inch-thick slices country white bread\n4 1/3-inch-thick slices from large red or orange heirloom tomato\n1 cup mayonnaise\n1 1/4 cups chopped fresh basil plus 8 large leaves, divided\n3 tablespoons chopped drained cornichons or dill pickle plus 1 1/2 tablespoons brine from jar","1. Preheat the skillet over medium heat on a stove top burner for five minutes.\n2. Place the frozen chicken patties in an even layer in the skillet.\n3. Cook the frozen chicken patties for about six minutes, or until they are completely brown on one side.\n4. Flip the patties with a spatula. Cook the patties on the opposite side for another six minutes or until the opposite side is brown.\n5. Remove the patties from the skillet with the spatula and place them on a plate lined with paper towels to drain any excess fat. Blot the tops of the patties with paper towels to remove fat from both sides.\n6. Mix mayonnaise, 1 cup chopped basil, cornichons, brine, and onions in small bowl.\n7. Grill bread until crisp and golden, about 1 minute per side. Transfer bread to plates. Grill burgers until firm to touch and cooked through, about 5 minutes per side.\n8. Spread bread slices thickly with basil mayonnaise. Top each bread slice with tomato, 2 basil leaves, burger, and dollop of basil mayonnaise. Garnish with remaining chopped basil."],[603,"Beef patties\n4 good-quality hamburger buns or rolls, split\n12 fresh arugula leaves\n1 large sweet onion, thinly sliced (about 2 cups)","1. Preheat the skillet over medium heat on a stove top burner for five minutes.\n2. Place the frozen beef patties in an even layer in the skillet.\n3. Cook the frozen beef patties for about six minutes, or until they are completely brown on one side.\n4. Flip the patties with a spatula. Cook the patties on the opposite side for another six minutes or until the opposite side is brown.\n5. Remove the patties from the skillet with the spatula and place them on a plate lined with paper towels to drain any excess fat. Blot the tops of the patties with paper towels to remove fat from both sides.\n6. Toast the buns on the grill or under the broiler until golden, 30 to 60 seconds. Serve the burgers on the toasted buns with the caramelized onions, mayonnaise, and arugula."],[604,"4 small fish fillets\n2 tablespoons flour\n1 egg, beaten\n1/2 cup breadcrumbs\n1 lettuce2 tomatoes\n4 multigrain rolls","1. Cover the fish fillets with flour.\n2. Dip the fish in the egg mix.\n3. Cover the fish with the breadcrumbs.\n4. Heat up a non stick frying pan with a drizzle of oil.\n5. Place the fish in the oil and cook for 4 minutes turning once.\n6. Slice the lettuce and tomatoes.\n7. Toast the buns in the oven for 3 minutes until hot.\n8. Place the fish piece on the roll, add some lettuce and a slice of tomato and serve."],[605,"1 pound shelled and deveined raw shrimp, divided\nOne piece fresh ginger, peeled and coarsely chopped\n2 scallions, coarsely chopped\n1/3 cup fresh cilantro leaves\n1/4 cup kimchi, coarsely chopped\n1 tablespoon canola or grapeseed oil","1. In the bowl of a food processor, combine about half the shrimp, the ginger and the scallions and pulse until the ginger and scallion are finely chopped and the shrimp has become a smooth paste. \n2. Add the remaining shrimp, the cilantro and kimchi, and pulse a few times so the shrimp is chopped but still quite chunky. \n3. Wet your hands and shape the mixture into four patties, rewetting your hands as necessary\n4. Refrigerate for 20 minutes.\n5. Heat a grill pan over medium heat. \n6. Brush both sides of each patty with oil and cook until a deep brown crust has formed outside the burger and the inside is cooked through, about 7 minutes per side.\n7. Serve in burger buns or lettuce wraps with sliced avocado, cucumber, ketchup."],[606,"1 lb lean ground beef\n2 to 3 tablespoons all purpose flour\n1 can French onion soup mix\n1 medium cut into rings onion\nmayonnaise\nyellow mustard\nwhole wheat or white hamburger buns","1. Brown ground beef and drain. \n2. Sprinkle in the flour.\n3. Add onion soup, stir and cook until meat mixture is thickened and most of the liquid is absorbed.\n4. Spread mustard and mayonnaise, to taste, on bread.\n5. Spoon the ground beef mixture onto bread and top with onion."],[607,"null","null"],[608,"1 lb (450 g) ground chicken or turkey\n1 pkgButter Chicken Seasoning\n4 burger buns\nToppings (optional): onion rings, cucumber ribbons, sliced avocado, baby spinach, 2% plain Greek yogurt","1. Preheat grill to medium-high heat. \n2. In a large bowl, combine chicken and seasoning. Using a fork or your hands, mix until well blended. Form into four patties.  \n3. Grill, with lid closed, 5–7 min per side, or until cooked. \n4. Tuck burgers into buns and serve with toppings, as desired."],[609,"5 strips bacon\n4 oz cream cheese (115 g), at room temperature\n¼ cup green onion (35 g), thinly sliced\n1 cup shredded sharp cheddar cheese (100 g)\n1 lb ground beef (455 g)\nsalt, to taste\npepper, to taste\n4 slices cheddar cheese\n4 hamburger buns, toasted","1. In a pan over medium-high heat, add the bacon, and cook until crispy. Transfer to a cutting board and roughly chop.\n2. In a bowl, add the bacon, cream cheese, green onions, and shredded cheddar. Mix well.\n3. Divide the ground beef into four even portions and shape into balls. Form a well into the center of each, large enough for the cheese mixture.\n4. Place a quarter of the cheese mixture into the center of each ball, and enclose inside the ground beef. Gently press each ball into a patty shape, and season both sides generously with salt and pepper.\n5. Heat a cast-iron pan over medium-high heat. Once hot, add the burgers and cook for 4-5 minutes on one side.\n6. Flip the burgers, and cook for 2 minutes. Add a slice of cheese on each burger and cook for an additional 2 minutes, until the burger is cooked through and the cheese is melted.\n7. Remove burgers from pan, and place on top a toasted burger bun. Top with condiments of your choice.\n8. Enjoy!"],[610,"320 grs of wheat flour or bread flour\n1 tbsp of instant yeast\n½ cup of whole milk, warm (at 98F-102F)\n2 tbps of sugar\n1 tsp of salt\n1 egg\n1 egg yolk\n20 grs of unsalted butter, room temperature\n1 sweet onion, chopped in small pieces\n½ cup of ketchup\n⅔ cups of mayonnaise\n2 tsps of mustard\nA pinch of ground black pepper\n4 tbsps of diced pickles\n2 tbps of apple cider vinegar\n1 lb of ground beef, 85% lean (15% fat)\n1 large tomato (the biggest you can get)\n1 Iceberg/romaine lettuce\n1 white onion, grilled in thick circled slices\n4 Slices of cheddar cheese (or the best American cheese you can find)\nSalt and pepper to taste (to season the beef patties)","1. It is a method of Asian origin in which we make a “roux” mixing flour, milk and water while cooking them over medium heat. When it thickens like heavy cream, remove it from fire and let it cool\n2. Warm milk between 98 and 102 °F and add instant yeast. Stir and let it act for about 10 minutes\n3. Mix the dry ingredients flour, salt and sugar. When they're ready, put them into the mixer at low speed\n4. Add yeast, Tangzhong dough, and eggs into the mixer\n5. After the mix is incorporated add the soft butter little by little. Then increase the mixer speed to medium and let it knead for at least 6 minutes.\n6. Grease a bowl throughly to transfer the dough. As it's wet dough, you'll need a spatula to remove it and put it in the bowl\n7. Cover well and let it rest for at least an hour and a half, or until it has doubled its size\n8. Flour a clean surface to place your dough\n9. Divide the dough into 6 pieces. If you want them to be the same, use a scale to weigh them\n10. Take a piece and stretch its edges. Then, bring them towards the center, turn it over and knead it in circular movements. Repeat with all the pieces. This way, your buns will be round with a tigh dough\n11. Put each ball on a tray with baking paper and squash them a little bit\n12. Cover the buns with another tray with a similar size or clean towels. Let them grow for one hour and a half, if you have cold weather. The most important thing is to let them double their size\n13. While the buns grow you can prepare the sauce and the toppings\n14. Prepare a bit of egg wash with whole milk and an egg. The egg wash will help your buns to acquire a shiny and golden tone, like brioche bread\n15. Varnish each of your buns with egg wash\n16. Bake your buns in a preheated oven at 400 °F to bake between 15 and 18 minutes. Still, keep an eye on the buns, so they tan well but don't get burnt\n17. After taking the buns out from the oven brush the buns with melted butter. This will make them look even more attractive and it will make them taste even better, of course!"],[611,"1 pound ground beef\n1 Tablespoon minced onion\n3 Tablespoons Worcestershire Sauce\n1/2 teaspoon salt\n1/4 teaspoon black pepper\n3 Tablespoons honey\n3 Tablespoons BBQ sauce\n3 hamburger buns","1. In a large bowl, combine ground beef, minced onion, Worcestershire sauce, salt, and pepper.\n2. Using your hands, mix well to combine.\n3. In a separate bowl, combine the honey and BBQ sauce and mix well.\n4. Separate meat into 3 roughly equal portions.\n5. Using a burger press, press each portion into a burger patty.\n6. Place the burger patties on a hot grill.\n7. Grill on one side for 3-5 minutes, until the burgers release easily from the grill. Flip burgers over.\n8. While the burgers are still cooking, brush the Honey-BBQ sauce over the top of the burgers with silicone brush.\n9. When the burgers are finished cooking, remove from the grill and place on hamburger buns.\n10. Brush each burger with more sauce."],[612,"2 portobello mushrooms (8 ounces), stems removed, cut into 1/2-inch pieces\n1 small zucchini\n1/4 cup extra-virgin olive oil, plus more for brushing\n1/4 cup minced shallot (1 large shallot)\n1/4 teaspoon red-pepper flakes\n1/4 cup finely grated Parmesan cheese\n3/4 cup quinoa, cooked according to package directions (2 cups cooked)\n2 teaspoons coarse salt\nFreshly ground pepper\n1 large egg, lightly beaten\n1 1/2 cups fresh whole-wheat breadcrumbs\n6 whole-wheat buns, split\nYogurt-Garlic Sauce for Veggie Burgers\n1 cup radish sprouts, or other fresh sprouts\n1/2 cucumber, peeled and cut diagonally into 1/4-inch-thick slices","1. Pulse mushrooms in a food processor until finely chopped, and transfer to a bowl.\n2. Shred zucchini, place on paper towels, and squeeze to remove excess moisture.\n3. Add to mushrooms.\n4. Heat 2 tablespoons oil in a large pan over medium heat.\n5. Add shallot and red-pepper flakes, and cook until softened, about 2 minutes.\n6. Add mushrooms and zucchini, and cook until tender, about 2 minutes.\n7. Remove from heat, and add Parmesan, quinoa, and salt.\n8. Season with pepper.\n9. Let cool completely, then stir in egg and breadcrumbs. \n10. Cover, and refrigerate until cold and firm, about 1 hour.\n11. Heat remaining 2 tablespoons oil in a large nonstick skillet over medium heat.\n12. Shape mixture into six 1/2-inch-thick patties, pressing firmly.\n13. Cook in batches until golden brown and cooked through, about 3 minutes per side.\n14. Wipe pan clean, and return to medium heat. Brush cut sides of buns with oil, and heat buns, cut sides down, until toasted, about 1 minute.\n15. Spread yogurt-garlic sauce on cut sides of bun halves.\n16. Divide burgers, sprouts, and cucumber among bottom halves. Sandwich with top halves."],[613,"1 package (10 oz) prebaked Italian whole wheat thin pizza crust\n1 package (8 oz) sliced fresh mushrooms\nOlive oil cooking spray\n3/4 cup marinara sauce\n1/4 cup sliced turkey pepperoni (about 15 slices)\n2/3 cup shredded part-skim mozzarella cheese\n1/4 teaspoon crushed red pepper flakes","1. Heat oven to 450°F. Place pizza crust on rack in oven while oven preheats, heat 5 minutes.\n2. Meanwhile, spray 12-inch skillet with cooking spray, heat over medium-high heat.\n3. Add mushrooms, cook 5 minutes, stirring occasionally, or until beef is thoroughly cooked. Drain.\n3. Remove crust from oven, place on ungreased cookie sheet. \n4. Spray crust with cooking spray, spread marinara sauce over crust, leaving 1-inch border.\n5. Top with pepperoni and cheese. Sprinkle with pepper flakes.\n6. Bake 7 to 10 minutes or until crust is golden and cheese is melted. Cut into 8 slices. Serve immediately."],[614,"2⁄3 cup water (11O°F to 115°F)\n1 teaspoon sugar\n1⁄8 ounce package fast rise yeast or 1/8 ounce package active dry yeast\n1 3⁄4 cups all-purpose flour or 1 3/4 cups bread flour\n1⁄2 teaspoon salt\n1 tablespoon cornmeal (optional)","1. Combine water and sugar in small bowl, stir to dissolve sugar.\n2. Sprinkle yeast on top, stir to combine.\n3. Let stand 5 to 10 minutes or until foamy.\n4. Combine flour and salt in medium bowl.\n5. Stir in yeast mixture.\n6. Mix until mixture forms soft dough.\n7. Remove dough to lightly floured surface.\n8. Knead 5 minutes or until dough is smooth and elastic, adding additional flour, 1 tablespoon at a time, as needed.\n9. Place dough in medium bowl coated with nonstick cooking spray.\n10. Turn dough in bowl so top is coated with cooking spray; cover with towel or plastic wrap.\n11. Let rise in warm place 30 minutes or until doubled in bulk.\n12. Punch dough down; place on lightly floured surface and knead about 2 minutes or until smooth.\n13. Pat dough into flat disc about 7 inches in diameter.\n14. Pat and gently stretch dough from edges until dough seems to not stretch anymore.\n15. Continue patting and stretching until dough is 12 to 14 inches in diameter.\n16. Spray 12- to 14-inch pizza pan with nonstick spray; sprinkle with commeal, if desired.\n17. Press dough into pan.\n18. Preheat oven to 5OOF.\n19. Baking pizza on bottom rack of oven."],[615,"2 original pizza crusts (345g)\n1 cup (250g) traditional marinara sauce\n1 ½ cups (136g) shredded part-skim mozzarella cheese\n12 oz (340g) bacon (diced)\n3 slices (171g) canned pineapple (diced)","1. Preheat oven to 425 degrees.\n2. Line a large baking sheet with foil or parchment paper, or use a pizza stone.\n3. Place pizza crusts (still frozen) on the prepared sheet or pizza stone.\n4. Spread ½ cup of marinara on each crust, leaving a ½-inch border around the edges.\n5. Sprinkle each with mozzarella.\n6. Top with the Canadian bacon and diced pineapple.\n7. Bake for 17-20 minutes or until the cheese is melted and lightly browned."],[616,"2 x 335g tomato sauce-topped pizza bases\n4 large_piece egg tomatoes (360g), sliced thinly\n4 mozzarella cheese (240g)\n1/4 cup finely shredded fresh basil","1. Preheat oven to 220°C/425°F.\n2. Oil two oven trays.\n3. Top pizza bases with tomato and cheese, season.\n4. Cook, uncovered, about 15 minutes.\n5. Sprinkle pizzas with basil."],[617,"1 pouch (6.5 oz) Pizza Crust Mix\n4 oz fresh mozzarella cheese, well drained\n1 can (14.5 oz) fire roasted diced tomatoes, drained\n1/4 teaspoon salt\nFresh cracked pepper to taste\n1/4 cup thin strips fresh basil leaves\n1 tablespoon chopped fresh oregano leaves\n1 tablespoon extra-virgin olive oil","1. Heat oven to 425°F.\n2. Grease cookie sheet or pizza pan.\n3. Press dough into 12-inch circle on cookie sheet or pizza pan, using floured fingers.\n4. Press dough from center to edge so edge is slightly thicker than center.\n5. Cut mozzarella into 1/4-inch slices.\n6. Place cheese on dough to within 1/2 inch of edge.\n7. Arrange tomatoes on cheese.\n8. Sprinkle with salt, pepper, 2 tablespoons of the basil and the oregano.\n9. Drizzle with oil.\n10. Bake 15 to 20 minutes or until crust is golden brown and cheese is melted.\n11. Sprinkle with remaining 2 tablespoons basil."],[618,"1 tablespoon oil\n1/2 eggplant, diced\n1 zucchini, diced\n1/2 red capsicum, diced\n1/2 yellow capsicum, diced\n1 cup classic pizza sauce mix\n1 sprig rosemary\n1 batch of classic pizza dough\n1/2 cup grated pizza cheese\nsea salt and cracked pepper","1. Preheat the oven to 190°C and line 2 baking trays with cooking paper.\n2. Heat the oil in a frying pan and saute the eggplant, zucchini and capsicum for 5-8 minutes until softened and just coloured.\n3. Add the pizza sauce mixture and rosemary, then cover and simmer for 8-10 minutes until saucy.\n4. Let the mixture cool.\n5. Divide the pizza dough in half, place it on the baking paper and roll out into a large round about 28-30cm.\n6. Divide the filling and arrange on one side of each pizza round and sprinkle over the grated cheese.\n7. Fold over the uncovered side to enclose the filling and crimp the edges with your fingertips.\n8. Sprinkle with sea salt and pepper and bake for 25-30 minutes until golden and puffed.\n9. Serve with avocado and fresh greens."],[619,"1 tablespoon olive oil\n2 crushed garlic cloves\n2 tablespoon finely chopped fresh sage leaves\n2 x 335g pizza bases\n100 gram thinly sliced ham\n200 gram thinly sliced mozzarella cheese","1. Preheat oven to 220°C/200°C fan-forced.\n2. Oil two oven trays.\n3. Combine olive oil, garlic cloves and fresh sage leaves in small bowl, spread over pizza bases then top with ham and cheese.\n4. Cook, uncovered, about 10 minutes."],[620,"Cooking spray\n4 cups fresh cauliflower florets\n2 eggs, beaten\n1 cup shredded reduced-fat mozzarella cheese (4 oz)\n2 tablespoons dried oregano leaves\n1 teaspoon garlic powder\n1/2 cup organic tomato basil pasta sauce (from 25.5-oz jar)\n1 small onion, thinly sliced\n1 bell pepper, thinly sliced, cut into bite-size pieces\n1/4 cup well-drained thawed frozen chopped spinach (from 9-oz box)\n6 ripe olives, sliced","1. Heat oven to 400° F.\n2. Line cookie sheet with cooking parchment paper, spray paper with cooking spray.\n3. In 3-quart saucepan, place steamer basket, add 1/2 inch water (water should not touch bottom of basket).\n4. Place cauliflower in basket, cover tightly and heat to boiling.\n5. Reduce heat to low, steam covered about 10 minutes or until soft.\n6. Place cauliflower in large bowl.\n7. Using potato masher, gently break cauliflower into rice-sized pieces.\n8. Wrap cauliflower in paper towel, squeeze to remove any excess water. Return cauliflower to bowl.\n9. Add eggs, cheese, oregano and garlic powder, mix to form soft dough.\n10. Divide dough into 4 equal pieces, place each on cookie sheet.\n11. Using hands, flatten each piece into round about 6 inches in diameter and 1/4 inch thick.\n12. Spray tops of rounds with cooking spray. Bake 20 minutes.\n13. Remove from oven. Turn crusts over, use paper towel to blot away any excess moisture.\n14. Spread each crust with pasta sauce. Top each with onion, bell pepper, spinach and olives.\n15. Return to oven, bake 5 minutes longer or until toppings are warm. Cut each pizza into 4 pieces; serve immediately."],[701,"300g beef, minced\n200g spaghetti (4 servings)\n1 can (170g) tomato paste\n1 onion, diced\n3 cloves garlic, chopped roughly\n1 carrot, shredded\n1 bay leaf\n1 tsp black pepper\nSalt to taste","1. Add in pasta and water just enough to cover the pasta.\n2. Add bay leaf, garlic, onion, carrots and tomato paste next.\n3. Prepare minced beef in a bowl, season with salt and pepper. Mix evenly and add to the rice cooker pot.\n4. Cover lid and set rice cooker to cook.\n5. When completed, open lid and mix up all the ingredients. Scoop to serve."],[702,"Kosher salt\n1 lb (450g) dried spaghetti\n1/2 cup (120ml) extra-virgin olive oil, divided\n4 medium cloves garlic, thinly sliced\nflat-leaf parsley, minced, for serving (optional)","1. Start by bringing a large pot of generously salted water to a rolling boil.\n2. Add spaghetti and while they're cooking, heat the olive oil in a saucepan and start gently sautéing garlic over low heat. Do not let the garlic burn!\n3. Add a splash of pasta water to the pan to stop the cooking, then transfer the nearly al dente spaghetti using tongs to the pan\n4. Cook it very shortly over high heat, tossing rapidly, so the pasta water and the oil merge into a sauce. Add more pasta water if needed!\n5. Lastly, if desired, add chopped parsley and toss again. Serve immediately."],[703,"1 clove garlic\n1/2 pound ground beef\n1 teaspoon Italian seasoning\n1 cup spaghetti sauce\n6 purchased precooked or oven-ready lasagna noodles (each about 7x3 inches)\n1 container (12 ounces) reduced-fat cottage cheese (1 1/2 cups)\n1 cup shredded mozzarella cheese (4 ounces)\n2 tablespoons grated Parmesan cheese","1. Heat the oven to 400°. Peel and finely chop the garlic. \n2. Cook the beef and garlic in the skillet over medium heat about 5 minutes, stirring occasionally, until the beef is brown, drain.\n3. Stir the Italian seasoning and spaghetti sauce into the beef.\n4. Spread 1/4 cup of the beef mixture in the ungreased square pan.\n5. Top with 2 noodles, placing them so they do not overlap or touch the sides of the pan because they will expand as they bake.\n6. Spread about 1/2 cup of the remaining beef mixture over the noodles.\n7. Spread about 1/2 cup of the cottage cheese over the beef mixture. Sprinkle with about 1/3 cup of the mozzarella cheese.\n8. Cover with aluminum foil and bake 30 minutes.\n9. Carefully remove the foil, and continue baking about 10 minutes longer or until lasagna is bubbly around the edges and looks very hot.\n11. Let stand 10 minutes, so the lasagna will become easier to cut and serve."],[704,"1 medium eggplant\n½ teaspoon kosher salt, plus more to taste\n¼ cup olive oil (60 mL), divided\n3 cloves garlic, smashed\n56 oz whole peeled tomato (1.75 kg), drained and roughly chopped, juices reserved\n½ teaspoon red pepper flakes\n1 lb whole wheat spaghetti (455 g)\n½ cup ricotta salata (125 g), crumbled\n1 bunch fresh basil, thinly sliced","1. Trim the ends of the eggplant, then slice into ½-inch (1 ¼ cm) thick rounds. Lay the eggplant rounds on a paper towel and season generously on both sides with salt. Let rest for 10 minutes to draw out excess moisture. After 10 minutes, pat the eggplant rounds with a paper towel to remove the moisture.\n2. Heat a griddle pan over medium-high heat and grease with 2 tablespoons of the olive oil, or your oil of choice. Grill the eggplant for about 2 minutes on each side, or until grill marks are formed. Set aside to cool, then cut into bite-size pieces.\n3. Heat the remaining 2 tablespoons of olive oil in a large pan over medium heat. When the oil is hot, add the smashed garlic and cook until fragrant and lightly browned but not burnt, flipping as needed. Remove the garlic from the oil and set aside to cool, then mince.\n4. To the garlic oil, add the chopped tomatoes. Cook for 5-10 minutes, or until caramelized. Add the reserved tomato juice and simmer until reduced to a sauce-like consistency, 5-8 minutes.\n5. Add ½ teaspoon salt, the red pepper flakes, and the minced fried garlic. Stir well, reduce the heat to low, and simmer while you make the pasta.\n6. In a large pot of boiling water, cook the pasta according to the package instructions. Drain and return to the pot.\n7. Pour the tomato sauce over the hot pasta. Add the eggplant, ricotta salata, and fresh basil. Toss until well combined.\n8. Serve immediately.\n9. Enjoy!"],[705,"½ teaspoon kosher salt, plus more to taste, divided\n1 box dried linguine\n½ stick unsalted butter\n2 medium garlic cloves, minced\n1 cup heavy cream (240 mL)\n¼ teaspoon freshly ground black pepper\n2 cups grated parmesan cheese (220 g)\n¼ cup fresh parsley (10 g), finely chopped","1. Bring a large pot of salted water to a boil over high heat. Cook the linguine according to package instructions until al dente. Reserve ¼ cup of pasta water, then drain the pasta in a colander.\n2. Melt the butter in a large saucepan over medium-low heat. Add the garlic and cook, stirring often, until aromatic, about 30 seconds.\n3. Add the heavy cream and simmer for 2 minutes. Add ½ teaspoon of salt, the pepper, and Parmesan and stir until the cheese has melted.\n4. Add the drained pasta and 1 tablespoon of reserved pasta water to the alfredo sauce and use tongs to toss until well coated, about 1 minute. If the sauce is too thick, add more pasta water, 1 tablespoon at a time.\n5. Remove the pan from the heat, top with parsley, and serve immediately.\n6. Enjoy!"],[706,"2 large eggs\n3 large egg yolks\n1 cup grated parmesan cheese (125 g)\n½ cup grated pecorino romano (60 g)\n1 teaspoon kosher salt, plus more for boiling\n1 teaspoon freshly ground black pepper, plus more for serving\n16 oz dried spathetti (450 g)\n4 oz bacon (110 g), sliced into 1/4 (6 mm)","1. In a medium bowl, whisk together the eggs, egg yolks, Parmesan, Pecorino Romano, salt, and pepper.\n2. Bring a large pot of salted water to a boil over high heat. Add the pasta and cook until al dente according to the package instructions. Reserve ½ cup of pasta water, then drain the pasta through a colander.\n3. While the pasta is cooking, add the bacon to a large pan over medium-high heat and cook, stirring occasionally, until crispy, about 8 minutes. Remove the bacon from the pan and transfer to a paper towel-lined plate. Leave the rendered bacon fat in the pan.\n4. Transfer the drained pasta to the pan with the bacon fat and toss with tongs for 1 minute, until fully coated. Remove the pan from the heat and let sit for 1 minute.\n5. Add 2 tablespoons of the reserved pasta water to the egg mixture and whisk to combine, then carefully pour the mixture over the pasta, quickly tossing to coat. Add the reserved pasta water, 1 tablespoon at a time, as necessary until the sauce is creamy and has the consistency of heavy cream.\n6. Add the bacon and toss to combine. Serve immediately topped with more freshly ground black pepper.\n7. Enjoy!"],[707,"450g flour\n5 eggs, beaten\nFor the filling\n100g spinach, blanched & squeezed of excess liquid\n300g ricotta\n100g parmesan, grated, plus more to serve\n1 lemon, zested\nA pinch of nutmeg\n100g butter\n10 sage leaves","1. To make the pasta dough, place the flour and eggs in the food processor and pulse until you are left with a crumbly mixture.\n2. Form it into a ball, cover with cling film and set aside in the fridge for 30 minutes.\n3. While the pasta is resting, prepare the filling by combining the chopped spinach, ricotta and parmesan.\n4. Season with the lemon zest, pepper and a pinch of nutmeg.\n5. Transfer the mixture to a piping bag fitted with a large round nozzle.\n6. Take your dough out of the fridge and cut in half.\n7. Roll out one half with a large rolling pin on a floured work surface.\n8. Roll it as thin as you can - so that you can see your hand through the dough.\n9. Cut the rolled pasta in half lengthways.\n10. Pipe on approx 6-8cm circles of the ricotta mixture to one sheet of the dough - leaving 5cm between each one.\n11. Brush around the filling with egg yolk and then lay another sheet of pasta on top, pressing gently to tease out any air pockets and seal.\n12. Cut out the ravioli and discard the scraps.\n13. Place the ravioli on a plate dusted with semolina and repeat with the other half of the pasta dough.\n14. Bring a large pot of water to a steady boil and season with sea salt and lower the ravioli into the water.\n15. Cook for 3-4 minutes or until al dente.\n16. At the same time that the pasta is cooking, melt the butter in a hot frying pan and add the sage leaves, frying until they are crisp and the butter is golden brown and nutty.\n17. Drain the ravioli and transfer to the butter and sage mixture.\n18. Swirl to coat and serve with more freshly grated parmesan, and a generous amount of freshly ground black pepper."],[708,"350 gr spaghetti\n1.5 kg carpet-shell clams, cleaned\n2 garlic cloves\n1 bunch parsley\n6 tbsp extra-virgin olive oil\n1 tip of the knife of peperoncino, optional\nsalt, to taste","1. Sauté the clams in two tablespoons of olive oil, together with one peeled and crushed garlic clove, and a small amount of previously washed and chopped parsley.\n2. Cover with a lid, and cook over high heat until the clams open, shaking the pan from time to time.\n3. Pluck the meat out of the clams, setting aside some of the clam shells for later, while discarding the rest. \n4. Filter the cooking liquid. \n5. Sauté the remaining garlic clove in four tablespoons of olive oil.\n6. Add the pepperoncino (optional), clam meat, and the cooking liquid, and sauté for a few minutes.\n7. Next, cook the spaghetti al dente, drain, and put them in the pan with clams, then mix everything well while still on the stove.\n8. Plate and decorate with clam shells and parsley."],[709,"300 gram macaroni pasta\n4 bacon rashers, chopped roughly\n80 gram butter\n1/3 cup (50g) plain flour\n1 litre (4 cups) milk\n1 cup (125g) coarsely grated cheddar cheese\n1/2 cup (40g) finely grated pecorino cheese\n1 1/2 tablespoon wholegrain mustard\n1/2 cup (35g) stale breadcrumbs","1. Add the pasta to a large pan of boiling, salted water, cook uncovered, until just tender, drain.\n2. Preheat oven to moderately hot (200°C).\n3. Meanwhile, cook the bacon in a medium pan, stirring, until the bacon is crisp, drain on absorbent paper.\n4. Melt 50g butter in the same pan, add the flour and cook, stirring, 1 minute.\n5. Gradually stir in the milk.\n6. Continue stirring until the sauce boils and thickens.\n7. Cool for 2 minutes, then stir in the cheeses, mustard and bacon.\n8. Combine the pasta and sauce in a large bowl. Transfer to an oiled, deep 2-litre (8 cup) capacity ovenproof dish.\n9. Top with the breadcrumbs, dot with remaining butter.\n10. Bake, uncovered, in a moderately hot oven, 30 minutes, or until the top is browned."],[710,"TROFIE PASTA\n360-480g (3-4 cups) durum wheat flour\ncoarse salt, to taste\n240 ml (1 cup) water, plus more if necessary\nPESTO GENOVESE\n50g (1.7 oz) Basilico Genovese\n70g (2.4 oz) Parmigiano-Reggiano or Grana Padano\n30g (1 oz) Pecorino Sardo or Pecorino Romano, or Pecorino Toscano\n15g (½ oz) pine nuts\n120 ml (½ cup) extra virgin olive oil\n2 cloves garlic\ncoarse salt, to taste","1. Mix salt and flour in a large bowl. Pour the water into the bowl and slowly mix the ingredients with a fork.\n2. When the mixture pulls together and gains shape, start mixing and kneading with your hands until it is well defined, meaning it doesn't leave any trace on the fingers after pushing them into the dough. Add a small amount of flour if the mixture is too wet or a small amount of water if it is too dry.\n3. Once the dough is defined, sprinkle some flour on your work surface or a wooden board. Transfer the dough onto the work surface and knead, making sure to turn the dough with each press, as that will activate the gluten and give trofie pasta texture. Proceed for 8-10 minutes until the dough becomes smooth.\n4. Form the dough into a disk, and sprinkle some flour on top and bottom, envelope it in plastic wrap, and store it in a refrigerator for at least one hour.\n5. Retrieve the dough from the freezer, sprinkle some flour on your work surface, as well as on the plate that will store formed noodles. Cut the dough into a rope section about 6-7mm (¼ inch) wide and roll the rope with your hands, similarly to the way children play with clay or playdough. While rolling, cover the rest of the dough to prevent it from drying out.\n6. Cut the rope into smaller horizontal pieces, about 2.5 cm (1 inch) in length. Take one piece and roll it between your palms to give it a swirly, crescent shape.\n7. Repeat the previous two steps until all the dough is turned into trofie noodles, which should be placed on a plate dusted with flour.\n8. Prepare the pestle and mortar, wash the basil leaves, and leave them to dry on a cloth.\n9. Meanwhile, put the peeled garlic in the mortar, along with a pinch of salt (to taste). Crush and grind the garlic until it turns pasty.\n10. Add the basil leaves gradually with small pinches of salt, which help with crushing the basil fibers.\n11. Crush the basil leaves gently, by rotating the pestle against the sides of the mortar, and (if possible) rotate the mortar in an opposite direction. Continue until the leaves are crushed, and start releasing a bright green liquid and scent.\n12. Add the pine nuts and proceed to stir until they are reduced into a creamy mixture.\n13. Gradually add both types of cheese to the mix and some extra virgin olive oil while continuously stirring the pestle until the mix is homogenous and compact.\n14. Meanwhile, prepare a pot of water, add some salt and bring it to a boil. Add the pasta. If the trofie pasta is ready-made, cook it according to the instructions, and if it is fresh, it should take around 4 minutes. Make sure that the pasta is al dente (not overcooked and soft, not too hard and chewy) then drain it. The noodles floating up to the top should indicate that the pasta is nearly cooked.\n15. Save some of the cooking water, and place the drained pasta in a large bowl or a saucepan.\n16. Next, add the pesto. If the pesto appears to be a bit dense, pour in some of the cooking water to achieve the desired consistency, as well as to warm it up a bit. Gently stir the mix until both the pasta and the pesto are well combined.\n17. Serve the trofie al pesto garnished with some grated Parmigiano-Reggiano and a sprig of basil."],[711,"3 ¼ cups cremini mushrooms (485 g), thinly sliced, divided (can use frozen mushrooms if desired)\n2 ½ tablespoons olive oil, divided\n1 ½ teaspoons fresh thyme, divided (if using dried, use half the amount)\n2 teaspoons kosher salt, divided\n¾ cup yellow onion (110 g), finely chopped\n1 teaspoon garlic, minced\n½ stick unsalted butter, divided\n¼ cup white wine (60 mL), or broth\n1 cup arborio rice (200 g)\n1 can Campbell’s® Family Size Cream of Mushroom Soup\n3 cups water (720 mL)\n1 ¾ cups grated parmesan cheese (215 g), plus more for garnish\n½ teaspoon freshly ground black pepper, plus more for garnish\n1 ½ tablespoons fresh parsley, plus more for garnish","1. Preheat the oven. Line a small baking sheet with parchment paper.\n2. On the prepared baking sheet, toss ¾ cup mushrooms with 1½ tablespoons olive oil, ½ teaspoon thyme, and ½ teaspoon salt until well coated.\n3. Bake the mushrooms for 10–15 minutes, or until crispy. Remove from the oven and set aside in a warm place.\n4. In a large pot, heat the remaining tablespoon of olive oil over medium heat. Add the onion and sauté until translucent, about 5 minutes. Add the garlic, remaining 2½ cups sliced mushrooms, remaining teaspoon of thyme, ½ tablespoon butter, and ½ teaspoon salt. Cook until fragrant, 6–8 minutes.\n5. Pour in the white wine and cook until slightly reduced, 1–2 minutes. Add the rice and stir until lightly toasted, about 1 minute.\n6. In a medium bowl or large measuring cup, combine the Campbell’s® Cream of Mushroom Soup and the water. Stir until completely combined.\n7. Add the mushroom soup mixture, about 1½ cups at a time, to the rice mixture and stir until reduced by half. Continue adding more liquid, stirring frequently, until rice is tender and the liquid has been fully absorbed, 10–15 minutes total.\n8. Reduce the heat to low and stir in the remaining 3½ tablespoons butter and the Parmesan cheese until melted and well incorporated. Remove the pot from the heat and stir in the remaining teaspoon of salt, the black pepper, and parsley.\n9. Immediately divide the risotto between serving bowls and garnish with more Parmesan, the roasted mushrooms, black pepper, and parsley.\n10. Enjoy!"],[712,"1 shallot\n1 garlic clove\n300 grams rice\nolive oil\n200 milliliters dry white wine\n250 grams pureed tomatoes (canned)\n600 milliliters vegetable broth\n3 tablespoons creme fraiche\n3 tablespoons freshly grated parmesan\nsalt\npeppers (freshly ground)\n2 tablespoons freshly chopped parsley","1. Peel shallot and garlic and chop finely.\n2. Heat 2 tablespoons of oil in a pan and saute shallot and garlic until translucent.\n3. Add rice and saute until rice becomes translucent.\n4. Deglaze pan with wine and cook, stirring, until wine is completely absorbed.\n5. Add tomatoes.\n6. Pour in enough broth so that rice is just covered and continue cooking, stirring, until almost all liquid has absorbed. \n7. Continue to add broth in this manner and cook until rice is al dente, stirring frequently.\n8. Add creme fraiche and Parmesan and mix well.\n9. Season with salt and pepper.\n10. Sprinkle with freshly chopped parsley and serve."],[713,"6 tablespoons olive oil, divided\n2 teaspoons garlic, minced, divided\n1 tablespoon shallot, minced\n1 cup arborio rice (230 g)\n¼ cup dry white wine (60 g)\n2 cups chicken stock (480 g), boiling\n14.5 oz tomato soup (410 g), 1 can\n6 tablespoons unsalted butter, cubed\n¼ cup parmesan cheese (30 g), freshly grated\nkosher salt, to taste\nwhite pepper, freshly ground, to taste\n8 large shrimps, peeled, deveined, tails on, butterflied\n¼ cup green peas (40 g)\n1 tablespoon fresh parsley leaf, for garnish, minced","1. In a medium skillet, heat 3 tablespoons olive oil over medium heat. Add the shallots and 1 teaspoon minced garlic, and sauté until soft, but not brown.\n2. Add the rice and sauté until well-coated with the oil. Deglaze the pan with the wine and reduce until the pan is almost dry.\n3. Using a 4-ounce (115 g) ladle, add one ladle of boiling stock to the rice. Stir the rice until the stock is absorbed and the rice is almost dry. Continue adding stock 1 ladle at a time until the rice is tender, but still firm. It should be moist and creamy, but not runny.\n4. Add the tomato basil bisque and stir to combine.\n5. Remove the risotto from the heat, and stir in the butter and the Parmesan cheese. Season with salt and pepper.\n6. Heat the remaining 3 tablespoons of olive oil in a medium skillet over medium heat. Add the remaining teaspoon of minced garlic and the shrimp. Season with salt and white pepper. Add the peas and cook until the shrimp is pink and opaque, 4-5 minutes.\n7. Remove the shrimp from the heat and sprinkle with parsley. Divide the risotto between 2 warm serving plates. Top each with half the shrimp and peas. Serve immediately.\n8. Enjoy"],[714,"olive oil\n200g steak cut into short, thin strips\n1 onion, finely chopped\n2 cloves garlic, crushed\n300g rice\ntablespoon of thyme leaves\n700ml vegetable stock\n200g frozen peas\n200g soft cheese","1. Heat oil in a large saucepan over medium heat.\n2. Add the gammon and stir-fry until starting to brown.\n3. Remove from the pan and set aside.\n4. Add the onion and garlic to the pan, cover and cook gently for 5 mins until softened.\n5. Add the rice to the pan and cook for 1 min stirring continuously.\n6. Add the thyme.\n7. Add the stock and let the rice mixture simmer away until the rice has nearly absorbed all the stock.\n8. When the rice has nearly cooked, add the peas and gammon and stir through.\n9. By this time all of the stock should be absorbed by the rice.\n10. Stir in the soft cheese and season to taste."],[715,"olive oil, to taste\n½ large yellow onion, diced\n3 cloves garlic, minced\n½ tablespoon fresh rosemary, minced\n1 ½ cups short-grain brown rice (300 g)\n5 ½ cups vegetable broth (1.3 L), divided\n2 cups butternut squash (410 g), diced\nsalt, to taste\npepper, to taste\n1 bunch fresh sage, optional\n¾ cup freshly grated parmesan cheese (80 g)\n2 tablespoons unsalted butter","1. Heat the olive oil in a Dutch oven or large oven-safe pot over medium heat. Add the onion and cook for about 5 minutes, until starting to brown.\n2. Add the garlic and rosemary, and cook for 2 minutes, until fragrant.\n3. Add the rice and 4 cups (960 ml) of vegetable broth, and stir to combine. Bring to a boil, then cover.\n4. Place the risotto on the bottom rack of the oven. Bake for 70 minutes, until all of the liquid has been absorbed by the rice. (It will appear dry, but you’ll be adding moisture back later in the recipe.)\n5. Add the butternut squash to the prepared baking sheet. Drizzle with olive oil, then season with salt and pepper. Toss to coat.\n6. Place the squash on the top rack of the oven, above the risotto. Bake for 45 minutes, or until the edges of the squash begin to brown and caramelize.\n7. Make the fried sage garnish, if using: In a small pot or pan over medium-high heat, add enough olive oil for the sage leaves to sit in. Once hot, carefully place a few leaves into the oil with tongs. Fry for 10-20 seconds, until the leaves are crispy but not browned.\n8. Carefully remove from the oil and drain on a paper towel-lined plate. Sprinkle with salt and set aside.\n9. Remove the risotto from the oven. Add the remaining vegetable broth, the Parmesan, and butter. Stir until creamy. (The liquid will absorb into the rice as you stir).\n10. Add the butternut squash and stir to incorporate.\n11. Serve immediately with fried sage for garnish.\n12. Enjoy!"],[716,"1/2 pound boneless, skinless chicken breast halves, cut into 1/2-inch pieces\n2 cups chicken broth (from 32 oz carton)\n1 cup uncooked regular long grain rice\n1/2 pound asparagus, cut into 1 1/2-inch pieces\n4 ounces sliced Canadian-style bacon, cut up\n1 teaspoon chopped fresh or 1/4 teaspoon dried basil leaves\n1/4 cup shredded Parmesan cheese","1. Spray 12-inch nonstick skillet with cooking spray, heat over medium-high heat.\n2. Cook chicken in skillet 3 to 5 minutes, stirring frequently, until light brown.\n3. Stir in broth, heat to boiling.\n4. Stir in rice, reduce heat.\n5. Cover and simmer without stirring 10 minutes.\n6. Stir in asparagus, Canadian bacon and basil.\n7. Cover and simmer without stirring 8 to 10 minutes or until rice is tender and chicken is no longer pink in center, remove from heat.\n8. Stir in cheese."],[717,"70g shiitake\n70g mushroom\n1 clove of garlic\n1l water\n1 vegetable broth pill\n250g rice\n1 onion\n1 glass white wine\n2 tablespoons extra virgin olive oil","1. Put in a pot the water and the broth tablet, and let it dissolve.\n2. Add the shiitake mushrooms and the mushrooms to the pot and cook them for 5 minutes. After this time, take them out and reserve them.\n3. In a frying pan, heat the oil and chop the garlic and onion. When the oil is hot, toss the garlic and the onion in the pan and let it be done until the onion is poached.\n4. Put the mushrooms and mushrooms in the pan with the onion, and let them be done for 3 minutes.\n5. Next, put the rice in the pan and stir it for 3 more minutes.\n6. Add the wine and let it reduce, stirring from time to time. \n7. When you see that the rice has absorbed the wine, take a saucepan of hot vegetable broth, and repeat every time the rice is running out of liquid, until all the broth has been poured.\n8. Once have absorbed all the broth that we had, stir again, turn off the heat and serve hot, with a little vegan parmesan cheese sprinkled on top if you want to highlight its flavor."],[718,"300g basmati rice\n25g butter\n1 large onion, finely sliced\n1 bay leaf\n3 cardamom pods\nsmall cinnamon stick\n1 tsp turmeric\n4 skinless chicken breasts, cut into large chunks\n4 tbsp curry paste\n85g raisins\n850ml chicken stock\nchopped coriander and toasted flaked almonds to serve","1. Soak the rice in warm water, then wash in cold until the water runs clear. \n2. Heat butter in a saucepan and cook the onions with the bay leaf and other whole spices for 10 mins. \n3. Sprinkle in the turmeric, then add chicken and curry paste and cook until aromatic.\n4. Stir the rice into the pan with the raisins, then pour over the stock. \n5. Place a tight-fitting lid on the pan and bring to a hard boil, then lower the heat to a minimum and cook the rice for another 5 mins.\n6. Turn off the heat and leave for 10 mins. \nStir well, mixing through half the coriander. \n7. To serve, scatter over the rest of the coriander and the almonds."],[719,"3 pounds Mutton with Bones, Small Cubes\n3 Roma Tomatoes\n1/4 cup Oil\n3 tablespoons Ginger-Garlic Paste\n1 packet Bombay Biryani Masala, Take half Packet for less spicy\n2/3 cup Full Fat Plain Yogurt\n1/2 cup Fried Onions,\n1/4 cup Chopped mint\n1/4 cup Chopped Cilantro\n2 cups Basmati Rice, soaked in water for 15 minutes\n8-10 cups Water\n1 Lemon Juiced\n1/4 teaspoon Caraway Seeds\n1 piece Cinnamon Stick\n2-3 Green Cardamom Pods\n2 Cloves\n8-10 Threads of Saffron","1. Thoroughly wash and clean Mutton. In a large bowl, combine mutton, ginger-garlic paste, and Biryani spices. Mix it well and set it aside.\n2. Heat oil in an InstantPot or Pressure cooker on medium heat. Add marinated Mutton and fry the meat and spices until fragrant. Cover and pressure cook on high for 25 minutes.\n3. Meanwhile, bring water to boil in a large pan and add washed Basmati rice, whole spices, green chili, salt, and lemon juice. Cook until rice is partially cooked or aldente. 4. Take out the rice in a large colander and drain all the water. Set it aside. Release the pressure of IP and set the curry aside.\n5. In a large Dutch oven or oven-safe pot, cook chopped tomatoes with a drizzle of oil until soft on medium-high heat. \n6. Add mutton curry and cook until curry becomes thick.\n7. Turn the heat off and add yogurt, fried onions, mint, cilantro, and garam masala. Mix gently and add potatoes in the curry.\n8. Meanwhile, preheat the oven at 365 F.\n9. Top the Curry with Rice. Swirl food coloring and soaked saffron on top of the rice and sprinkle the rest of the onions. Cover the lid and pop the Dutch Oven in the oven.\nBake the Biryani at 365 F for 25 minutes. Serve it hot with Yogurt Cucumber Raita."],[720,"½ cup oil (100 mL)\n4 eggs\n1 pinch salt\n½ lb boneless, skinless chicken breast (200 g), sliced\n1 ¾ cups rice (400 g), cooked\n5 oz mixed vegetable (150 g)\n¼ cup light soy sauce (50 mL)\n1 oz spring onion (30 g)","1. Heat a wok over medium-high heat for 5 minutes. Add the oil then stir in eggs and fry until just cooked. Once cooked, remove eggs from the wok and set aside.\n2. Heat up the wok until smoking hot and pour in the oil.\n3. Add the chicken breast and fry until they are just cooked.\n4. Add the rice and keep frying until they turn slightly brown.\n5. Add the vegetables and fry everything together until they are thoroughly cooked.\n6. Pour in the soy sauce and stir.\n7. Add the cooked eggs back in and toss them around until they break into pieces.\n8. Add in the spring onions and serve.\n9. Enjoy!"],[801,"6 oz filet mignon (170 g)\ncoarse salt, to taste\nfreshly ground black pepper, to taste\n1 tablespoon grapeseed oil, or other high-heat, neutral oil of choice\n2 tablespoons unsalted butter\n2 sprigs fresh rosemary\n1 clove garlic","1. On a cutting board, pat the filet mignon dry with paper towels and let sit at room temperature for 20-30 minutes.\n2. Preheat the oven to 450˚F (230˚C).\n3. Generously season all sides of the filet mignon with salt and pepper.\n4. Heat a medium, oven-safe stainless steel or cast iron skillet over high heat for 5 minutes. Add the grapeseed oil.\n5. Once the oil beings to smoke, add the filet mignon to the pan. Cook without moving for 2-3 minutes, until a crust has formed.\n6. Use tongs to flip the steak over, then add the butter, rosemary, and garlic to the pan.\n7. Tilt the pan and spoon the butter continuously over the steak for 2-3 minutes.\n8. Transfer the pan to the oven for 7 minutes for a medium rare steak.\n9. Transfer the steak to a cutting board and let rest for at least 10 minutes before slicing.\n10. Enjoy!"],[802,"2 ½ lb ribeye steak (1 kg), room temperature\n1 teaspoon kosher salt, plus more to taste\n1 teaspoon black pepper, plus more to taste\n1 tablespoon olive oil\n1 ½ tablespoons unsalted butter, divided\n1 small shallot, diced\n1 ½ tablespoons capers in brine\n¼ cup dry white wine (60 mL)\n2 tablespoons dijon mustard\n2 tablespoons heavy cream\nthinly sliced chive, for garnish\npotato, roasted, for serving\nside salad, for serving","1. Pat the steaks dry with a paper towel. Season generously on both sides with the salt and black pepper.\n2. Add the olive oil and 1 tablespoon of butter to a nonstick or stainless steel pan over medium-high heat. Sear the steaks, one at a time, until a golden brown crust forms, about 5 minutes per side. If the pan gets too dry, add a bit more olive oil. Transfer the seared steaks to a cutting board to rest.\n3. Add the shallots, capers, and remaining ½ tablespoon of butter to the pan. Cook for 2-3 minutes, or until the capers crisp slightly.\n4. Deglaze the pan with the wine. Cook until reduced by half, about 30-60 seconds. Add the mustard and cream and adjust seasoning to taste.\n5. Slice the steak into ¼-inch (6 mm) pieces and transfer to serving plates. Pour the sauce over the steak and garnish with sliced chives. Serve with roasted potatoes and a side salad.\n6. Enjoy!"],[803,"4 6 ounce beef tenderloin steaks\n1 1/2 teaspoons kosher salt\n1 teaspoon black pepper\n2 Tablespoons butter\n1 Tablespoon olive oil","1. Remove steaks from the refrigerator at about an hour before you're ready to cook thme. The steaks need to be room temperature to cook through perfectly.\n2. Preheat oven to 400°.\n3. Pat steaks dry.\n4. Season both sides very generously with salt and pepper. Press salt and pepper if needed to help it stick to the meat.\n5. Heat a cast-iron skillet, or heavy skillet, over medium-high to high heat.\n6. Add butter and olive oil.\n7. Add steaks and sear for 2-3 minutes per side. Spoon butter over steaks as they cook.\n8. Insert an oven-safe thermometer and set an alarm for desired temperature (remember the temperature will rise about 3-5 degrees as the steaks rest).\n9. Put steaks in the oven and bake until they reach the desired temperature.\n10. This will take between 6-10 minutes depending on the thickness of the steaks and how hot you want them."],[804,"1 24-ounce Porterhouse Steak\n2 tablespoons extra virgin olive oil\n2 tablespoons beef rub\n2 tablespoons compound butter","1. Preheat your smoker to 250 degrees Fahrenheit (F) using a fruit wood like apple or cherry.\n2. Coat the steak with olive oil, then coat all sides generously with the dry rub.\n3. Place the seasoned steak on the smoker and smoke for 30 – 45 minutes or until the internal temperature of the Porterhouse is at 110 degrees F in the thickest part.\n4. Once the internal temperature of the steak is achieved, pull the steak off the smoker and set it aside briefly, and prepare it for direct grilling targeting 450 – 500 degrees F. \n5. Remove from the grill and then let rest for 10 minutes."],[805,"3/4 to 1 lb beef sirloin sliced into thin strips\n1 medium yellow onion sliced into rings\n4 pieces scallions\n6 tablespoons soy sauce\n1 lime\n1/8 teaspoon ground black pepper\n1 teaspoon garlic powder\n1 1/2 cups beef broth\n2 tablespoons cooking oil","1. Combine soy sauce, lime, and beef in a bowl, Mix well and let it stay for at least 30 minutes.\n2. Heat oil in a pan and start to pan fry the beef sirloin in medium heat for 1 to 2 minutes per side.\n3. Pour-in the remaining marinade and the beef broth.\n4. Add garlic powder and ground black pepper. Stir.\n5. Cover and simmer for 20 to 35 minutes.\n6. Remove the cover and add the onion and scallion. Cook for 3 minutes.\n7. Transfer to a serving plate and serve."],[806,"2 new york strip steaks, room temperature (1 in thick 2.5 cm)\nkosher salt, to taste\nfreshly ground black pepper, to taste\n1 tablespoon canola oil\n3 tablespoons unsalted butter, cold\n1 shallot, thinly sliced\n3 garlic cloves, smashed\n3 sprigs fresh thyme","1. Preheat the oven to 425°F (220°C).\n2. Liberally season the steaks on both sides with salt and pepper.\n3. Heat the canola oil in a large oven-proof skillet over medium-high heat. Add the steaks and sear for 3–4 minutes, until a golden brown crust forms. Flip the steaks and sear for 1–2 minutes on the other side, then add the butter, shallot, garlic, and thyme to the pan. Baste the steaks with the butter and continue cooking for 2 more minutes.\n4. If the steak isn’t cooked to your liking, transfer to the oven and cook for 3–5 minutes, or until it reaches your desired temperature.\n5. Transfer the steaks to a cutting board and let rest for 10 minutes, then slice and serve.\n6. Enjoy!"],[807,"1 1-2 pound skirt steak\n1 Tablespoon brown sugar\n1 teaspoon black pepper\n1 teaspoon salt\n1 teaspoon chili powder\n1 teaspoon garlic powder\n1 teaspoon onion powder\n1/2 teaspoon ground chipotle chilis\n1/4 teaspoon ground cayenne pepper","1. Preheat your grill to High heat (400-450 degrees F) for direct grilling.\n2. Trim any excess fat or silver skin left on the skirt steak.\n3. Season liberally with the chipotle seasoning, using your fingers to press the rub into the meat.\n4. Place the steak on the grill grates directly over the heat and grill for 3-4 minutes per side.\n5. Stay close and monitor until the internal temperature reaches 125-135 degrees F.\n6. Remove the steak when it has reached your desired doneness. Rest for 10 minutes.\n7. Slice against the grain by cutting the long steak into three shorter sections first and then cutting into thin strips."],[808,"800g Hanger Steak\nSea Salt\n1 small yellow pepper, seeds removed, roughly chopped\n6 Yellow baby Tomatoes\n1 small red chilli, seeds removed\n½ tsp dried flaked chillies\n2 Garlic cloves, peeled\n20g fresh parsley, including any tender stalks\n10g each fresh basil, tarragon and chives\n1 tbsp habanero vinegar\n150ml rapeseed oil","1. It’s important that your steaks are removed from the fridge at least 30 minutes before cooking.\n2. Light your bbq and leave the coals until they are glowing and grey.\n3. Meanwhile to make the chimichurri sauce, blend all the sauce ingredients in a powerful food processor until thoroughly combined. \n4. When the coals are ready, brush one side of the steaks with a little rapeseed oil and place brushed side down on the grill.\n5. Season the showing side generously with salt and grill for 3 minutes.\n6. Flip the steak over, add a light sprinkling of salt and continue grilling for a further 2 minutes.\n7. Allow to rest somewhere warm for 4 minutes and then enjoy with your friends."],[809,"For the spice rub\n1 teaspoon ground cumin\n1 1/2 to 2 teaspoons kosher salt or more to taste\n2 teaspoons ground coriander\n1 teaspoon paprika\n1 teaspoon freshly ground black pepper\n1 teaspoon garlic powder (optional)\n1/2 teaspoon cayenne pepper or more to taste\nFor the steak\nOne (3-pound) flank steak\nOlive oil for the grill","1. In a baking dish large enough to fit the steak, stir together all the ingredients.\n2. Add the steak to the spice rub, turning to coat the meat thoroughly with the rub and pressing with your fingers to help the rub adhere to the meat. If you have the time, cover and toss the steak in the fridge for at least 1 hour and up to 6 hours.\n3. When you’re ready to cook the steak, let it rest at room temperature while the grill is heating.\n4. Build a hot fire in a charcoal grill or preheat a gas grill to high.\n5. Using a grill brush, scrape the heated grill rack clean.\n6. Lightly coat a paper towel with oil and, holding it with long tongs, carefully rub the oiled towel over the grill rack.\n7. Place the flank steak directly over the flame or heating element grill and let it cook, undisturbed, for about 3 minutes.\n8. Rotate the steak 90° and let it cook, undisturbed, for another 3 minutes.\n9. Flip the steak and repeat on the other side so it cooks another 3 minutes undisturbed, is rotated 90°, and then cooks 3 more minutes. If you like your steak medium-rare, it should be done at this point [an instant-read thermometer inserted into the thickest portion of the steak should read 130°F (54°C)]. If you like your steak medium or well done, move the steak to a cooler part of the grill for a few more minutes to cook to the desired doneness.\nMove the steak to a cutting board, cover it loosely with foil, and let it rest for 10 minutes. Carve it against the grain into slices about 1/2 inch thick, pile them onto a platter, and serve immediately."],[810,"2 (1-pound) flat iron steaks\nSalt and freshly ground black pepper\n3 tablespoons extra-virgin olive oil\n6 tablespoons cold unsalted butter\n1 onion, thinly sliced\n1 tablespoon minced garlic\n1 teaspoon dried oregano\n1/4 cup tomato paste\n2 1/2 cups dry red wine","1. Prepare the grill or barbecue.\n2. Sprinkle the steaks with salt and pepper and drizzle with the 3 tablespoons of olive oil.\n3. Grill to desired doneness, about 5 minutes per side for medium-rare.\n4. Transfer the steaks to a cutting board. Tent with foil and let stand 10 minutes.\n5. Meanwhile, melt 2 tablespoons of butter in a heavy large saucepan over medium-high heat.\n6. Add the onions and saute until tender, about 5 minutes. \n7. Season with salt.\n8. Add the garlic and oregano and saute until fragrant, about 30 seconds.\n9. Stir in the tomato paste and cook for 2 minutes, stirring constantly.\n10. Whisk in the wine.\n11. Simmer until the sauce reduces by half, stirring occasionally, about 10 minutes. Remove the skillet from the heat.\n12. Strain the sauce into a small bowl, pressing on the solids to extract as much liquid as possible.\n13. Discard the solids in the strainer and return the sauce to the saucepan and bring back to a slow simmer.\n14. Cut the remaining 4 tablespoons of butter into small 1/2-inch chunks and whisk in the sauce a little at a time. Season the sauce, to taste, with salt and pepper.\n15. Thinly slice the steaks across the grain. Divide the steak slices among 6 plates.\n16. Drizzle the sauce over the steak, drizzle a little more extra-virgin olive oil and serve."],[811,"2 clove Garlic\nminced 1 tablespoon Chopped Fresh Parsley\n1 count Salt \nGround Black Pepper ¼ cup Soy Sauce\n1 tablespoon Butter\n8 ounce Mushrooms\n1 count Garlic Salt","1. In a small bowl mix the garlic, parsley, and basil.\n2. Rub the mixture into the steak and season with the salt and pepper.\n3. Pour the soy sauce into a resealable plastic bag.\n4. Add the steak to the bag and turn to coat.\n5. Marinate in the refrigerator, turning the bag occasionally, about 2 hours.\n6. Drain the meat and bring the marinade to a boil in a small saucepan.\n7. Allow the meat to come to room temperature while heating the grill to medium-high. Grill the meat until it is pink and juicy in the middle, 6 to 10 minutes per side.\n8. Baste with the marinade while the meat is cooking. Remove from the grill while the meat is still very pink, it will continue to cook.\n9. Transfer the meat to a cutting board to rest 5 minutes before slicing.\n10. Meanwhile, heat the butter in a small skillet over medium heat.\n11. Cook and stir the mushrooms for a few minutes.\n12. Sprinkle with garlic salt. Thinly slice the meat across the grain and place it on a platter. Spoon the mushrooms over the top."],[812,"1/2 kilo pork spareribs cut into serving portions\n1/2 cup sweet chili sauce\n1/2 tsp sesame oil\n3 Tbsp flour\n1/2 cup pineapple juice\n1/4 cup soy sauce\n2 tablespoons garlic chopped\n2 tablespoons brown sugar\n1 tablespoons black pepper\n1 tablespoons ginger shredded","1. Marinate spareribs in pineapple juice, soy sauce, garlic, brown sugar, black pepper and ginger for about 1 hour.\n2. Simmer ribs with marinade for about 40 minutes or until almost tender. Drain but reserve half cup broth.\n3. Coat meat with flour. Deep fry until just brown. In a separate pan, combine broth, sweet chili sauce and sesame oil.\n4. Allow to simmer, then add meat. Stir until meat is evenly coated with sauce.\n5. Caramelize over medium heat for another 10 minutes. Serve hot. Can be serve as rice topping."],[813,"1 1/2 pound rack of lamb\n2 cloves garlic, minced\n1 tablespoon chopped fresh oregano\n1 teaspoon fresh rosemary, chopped\n1 teaspoon fresh thyme, chopped\n1/2 teaspoon coarse Kosher sea salt\n1/4 teaspoon fresh ground black pepper\n1/4 cup olive oil\n1 tablespoon fresh squeezed lemon juice","1. Combine the minced garlic, chopped oregano, rosemary, thyme, sea salt, and black pepper with the olive oil and lemon juice to create a rub. Mix well.\n2. Rub the lamb rack all over with the rub.\n3. Place the lamb with the rub in a large freezer bag, squeeze out the air and seal.\n4. Place the bag on a plate and refrigerate for at least 2-3 hours, turning occasionally, up to overnight.\n5. Bring the lamb out of the refrigerator at least one hour before baking.\n6. Score the fat with a sharp knife all over. Preheat the oven to 450F.\n7. Remove the rack from the bag and place on a baking pan. Cover the exposed ribs with aluminum foil.\n8. Roast on the middle shelf of the oven for 10-15 minutes to brown the top, then reduce the heat to 300F.\n9. Continue to roast for 10-30 minutes longer, checking the temperature after 10 minutes, until the meat in the middle of the rack reaches desired temperature, 120-125 Rare, 135-145 medium."],[814,"1 Boneless leg of lamb\n4 Cloves of garlic peeled and sliced\n3 tablespoons Dijon Mustard\nSalt and pepper\nAbout a 2 foot piece of kitchen twine","1. Rinse and pat dry if the lamb came in plastic.\n2. Unravel the leg of lamb. Place on a work surface with the fat side touching the work surface, the inside facing you.\n3. Spread 2 tablespoons of the Dijon mustard on the inside as evenly as possible.\n4. Sprinkle the slice garlic over the mustard.\n5. Season with salt and pepper.\n6. Roll the leg of lamb so it looks like a roast.\n7. Take the string and wrap the roast as if it were a gift and the twine is the ribbon--once round the width, cross and once around the length, tie a square knot. \n8. Place lamb in roasting pan seam side down.\n9. Spread remaining tablespoon of mustard on top of roast and season with salt and pepper.\n10. Insert a meat thermometer in roast.\n11. Place in 400 degree oven for 20 minutes reduce heat and continue cooking for about an hour or until that thermometer reads the doneness you like."],[815,"6 lb lamb shanks (2.7 kg), 1 pound (455 g) each\nkosher salt, to taste\nfreshly ground black pepper, to taste\n2 tablespoons canola oil\n2 medium carrots, minced, plus 1 pound (455 grams) oblique-cut\n1 medium white onion, minced\n2 stalks celery, minced\n20 cloves garlic, minced, plus 15 whole, divided\n2 tablespoons tomato paste\n1 cup red wine (240 mL)\n4 cups chicken stock (960 mL)\n1 orange, juiced\n1 lemon, juiced\n5 sprigs fresh rosemary\n10 sprigs fresh thyme\n3 bay leaves\n1 lb brussels sprouts (455 g), halved\n1 lb red pearl onion (455 g), peeled\nolive oil, for drizzling\n3 lb yukon gold potato (1.3 kg), peeled, chopped, and boiled\nwhite pepper, to taste\n½ cup unsalted butter (115 g), 1 stick, cubed and chilled\n1 cup sour cream (230 g)\n½ cup heavy cream (120 mL)\nCITRUS GREMOLATA\n¼ cup fresh parsley (10 g), chopped\n1 lemon, zested\n½ tablespoon flaky sea salt\n2 cloves garlic, minced\n2 tablespoons fresh chives, chopped\n1 teaspoon horseradish\norange, zested","1. Preheat the oven to 400°F (200°C).\n2. Season the lamb shanks all over with salt and pepper.\n3. Heat the canola oil in a large Dutch oven over medium-high heat.\n4. Sear 2 lamb shanks at a time until a dark brown crust forms on one side, 3-5 minutes. Sear the other sides of the meat until evenly browned. Remove the shanks from the pan and set aside. Remove all but 2 tablespoons of fat from the pan.\n5. Add the minced carrots, onion, celery, and minced garlic to the pot. Season with salt and pepper, and cook until the vegetables are deeply caramelized, 15-20 minutes.\n6. Add the tomato paste and cook until it browns and is aromatic, 5 minutes.\n7. Add the red wine and scrape the bottom of the pot to release the flavorful browned bits stuck to the bottom. Cook until the wine reduces by half and thickens slightly, 3 minutes.\n8. Add the chicken stock, orange juice, lemon juice, rosemary, thyme, and bay leaves. Stir and bring to a boil.\n9. Return the lamb shanks to the Dutch oven, cover, and place in the oven for 2 hours, turning the shanks halfway through, until the lamb is tender and the braising liquid has thickened.\n10. About halfway through the lamb cooking time, add the oblique-cut carrots, Brussels sprouts, red pearl onions, and whole garlic cloves to a baking sheet. Drizzle with olive oil and season with salt and pepper. Toss to combine. Roast in the oven for 1 hour, or until the vegetables are tender.\n11. Right after the potatoes finish boiling, drain and transfer to a large bowl. Season with plenty of salt and a bit of white pepper, and mash the potatoes until as smooth as possible.\n12. Fold in the butter, sour cream, and heavy cream until smooth and light.\n13. Make the citrus gremolata: In a small bowl, combine the parsley, lemon zest, flaky salt, garlic, chives, horseradish, and orange zest.\n14. To serve, scoop mashed potatoes onto a plate. Add roasted vegetables and a lamb shank. Top with the braising liquid and citrus gremolata.\n15. Enjoy!"],[816,"2 large ears of sweet corn, husks and silk removed\nunsalted butter, to taste\nsea salt\n2 large garlic cloves, unpeeled\nolive oil, for marinating\n4 lamb loin chops, 1- to 1 1/2-inches thick\nfreshly ground black pepper\n1 tbsp chopped fresh rosemary\n1/4 cup extra virgin olive oil","1. Prepare a grill for medium-high heat, with two areas for grilling.\n2. Lay each ear of corn on a piece of aluminum foil big enough to wrap around it about 2 times. Spread all sides lightly with butter and season with salt. Roll up the foil and twist the ends shut. \n3. Rub the garlic cloves with oil and thread onto a small skewer.\n3. Place the ears of corn and garlic on the grill. Grill the garlic 2-3 minutes, turn, and grill 2-3 minutes longer, until slightly softened and charred. Remove and let cool.\n4. Grill the corn, turning every 3-4 minutes, for a total of 12-14 minutes. Remove and leave wrapped until ready to serve.\n5. Rub the lamb chops lightly with oil and season with salt and pepper. Grill 4-5 minutes per side, depending on thickness, until slightly charred on the outside and rare to medium-rare on the inside. Remove and let rest 3 minutes.\n6. While the lamb rests, peel and chop the grilled garlic. Combine the garlic, rosemary, and extra virgin olive oil in a small bowl and season with salt and pepper.\n7. To serve, place 2 lamb chops on each of 2 plates and drizzle with the garlic oil. Unwrap the corn and serve alongside."],[817,"thumb-sized piece ginger, ½ cut into matchsticks, the rest left whole\n2 onions, quartered\n4 garlic cloves\n2 tbsp rapeseed oil\n1 cinnamon stick\n1 tbsp ground coriander\n1 tsp ground cumin\n1 tsp ground turmeric\n½ tsp fennel seeds\n750g leg of lamb, diced\n400g can chopped tomatoes\n1 red chilli or green chilli, deseeded and sliced\nsmall bunch coriander, stalks finely chopped, leaves roughly chopped\nmango chutney","1. Put the whole piece of ginger, the onions and garlic in a food processor with 300ml water.\n2. Blitz to a smooth purée. \n3. Scrape down the sides with a spoon and blitz again to make it as smooth as you can. \n4. Tip into a deep sauté pan, cover with a lid and simmer for 15 mins. \n5. Remove the lid and cook for 5 mins more, stirring occasionally. By now the liquid should be all gone. If not, cook a little longer.\n6. Add the oil to the pan with the rest of the ginger. Turn up the heat and fry, stirring, for 3-5 mins until it starts to colour.\n7. Stir in the spices and add the lamb.Stir-fry until the lamb changes colour. \n8. Tip in the tomatoes with a can of water and the chilli, season well, cover and leave to simmer for 1 hr.\n9. Stir in the coriander stalks, re-cover and cook for a final 30 mins until the lamb is tender.\n10. Stir in the coriander leaves and serve with basmati rice and mango chutney."],[818,"3 tablespoons oil\n3 cups chicken (400 g)\n1 teaspoon salt\n1 teaspoon pepper\n1 ⅓ cups onion (200 g), chopped\n¾ cup carrot (100 g), chopped\n1 cup potato (200 g), chopped\n4 ¼ cups water (1 L)\n⅔ cup peas (100 g)\n⅔ cup curry paste (150 g)","1. Heat up 2 tablespoons of oil on low to medium heat.\n2. Sear the chicken until the outside turns golden brown. Season with salt and pepper.\n3. Take out the chicken, make sure you don’t clean the pot or you’d wipe away some deliciousness!\n4. Add another tablespoon of oil, fry the onions, carrots, and potatoes until soften.\n5. Add the chicken back in with the water. Bring to a boil then simmer for 10 minutes with the lid on.\n6. Add in the peas and curry paste, stir well.\n7. Serve with rice.\n8. Enjoy!"],[819,"2 lb boneless, skinless chicken breast (910 g), cubed\nsalt, to taste\npepper, to taste\n2 teaspoons chili powder, divided\n½ teaspoon turmeric\n6 tablespoons butter, divided\n1 ½ cups yellow onion (225 g), diced\n3 teaspoons garam masala\n1 teaspoon cumin\n1 teaspoon cayenne pepper\n1 tablespoon ginger, grated\n3 cloves garlic, minced\n1 cinnamon, 3 inch (8 cm) stick\n14 oz tomato sauce (395 g)\n1 cup water (240 mL)\n1 cup heavy cream (240 mL)\nrice, for serving\nfresh cilantro, chopped for garnish","1. In a large bowl, season the chicken breast with salt, pepper, 1 teaspoon of chili powder, and the teaspoon of turmeric. Let sit for 15 minutes to marinate.\n2. Melt 2 tablespoons of butter in a large pot over medium heat. Brown the chicken, then remove from the pot.\n3. Melt another 2 tablespoons of butter in the pot, then add the onion, garam masala, remaining teaspoon of chili powder, the cumin, ginger, garlic, cayenne, cinnamon, salt and pepper. Cook until fragrant.\n4. Add the tomato sauce and bring to a simmer.\n5. Add the water and cream and return to a simmer.\n6. Return the chicken to the pot, cover, and simmer for another 10-15 minutes.\n7. Stir in the last 2 tablespoons of butter and season with more salt and pepper to taste.\n8. Serve the chicken over rice and garnish with cilantro.\n9. Enjoy!"],[820,"CHICKEN MARINADE\n3 boneless, skinless chicken breasts\n½ cup plain yogurt (125 g)\n2 tablespoons lemon juice\n6 cloves garlic, minced\n1 tablespoon minced ginger\n2 teaspoons salt\n2 teaspoons ground cumin\n2 teaspoons garam masala\n2 teaspoons paprika\n\nSAUCE\n3 tablespoons oil\n1 large onion, finely chopped\n2 tablespoons minced ginger\n8 cloves garlic, minced\n2 teaspoons ground cumin\n2 teaspoons ground turmeric\n2 teaspoons ground coriander\n2 teaspoons paprika\n2 teaspoons chili powder\n2 teaspoons garam masala\n1 tablespoon tomato puree\n3 ½ cups tomato sauce (800 g)\n1 ¼ cups water (300 mL)\n1 cup heavy cream (250 mL)\n¼ cup fresh cilantro (10 g), for garnish\ncooked rice, for serving\nnaan bread, for serving","1. Slice the chicken into bite-sized chunks. Combine the cubed chicken with the yogurt, lemon juice, garlic, ginger, salt, cumin, garam masala, and paprika and stir until well-coated.\n2. Cover and refrigerate for at least 1 hour, or overnight.\n3. Preheat the oven to 500°F (260°C). Line a high-sided baking pan or roasting tray with parchment paper.\n4. Place the marinated chicken pieces on bamboo or wooden skewers, then set them over the prepared baking pan, making sure there is space underneath the chicken to help distribute the heat more evenly. Bake for about 15 minutes, until slightly dark brown on the edges.\n5. Make the sauce: Heat the oil in a large pot over medium heat, then sauté the onions, ginger, and garlic until tender but not browned. Add the cumin, turmeric, coriander, paprika, chili powder, and garam masala and stir constantly for about 30 seconds, until the spices are fragrant. Stir in the tomato puree, tomato sauce, and 1 ¼ cups of water, then bring to a boil and cook for about 5 minutes. Pour in the cream.\n6. Remove the chicken from the skewers and add to the sauce, cooking for another 1-2 minutes. Garnish with cilantro and serve over rice or alongside naan bread.\n7. Enjoy!"],[821,"1 tablespoon vegetable oil\n1 large onion, diced\n2 cloves garlic, minced\nginger, peeled and grated, 1 inch (2 1/2 cm) piece\n1 jalapeño, or green chile, seeded and sliced\n2 tablespoons garam masala\n1 teaspoon turmeric\n1 teaspoon salt\n1 teaspoon black pepper\n2 cups fresh tomato (400 g), diced\n15 oz chickpeas (425 g), drained and rinsed, 2 cans\n½ cup water (120 mL)\n½ lemon, juiced\n¼ cup fresh cilantro (10 g), chopped","1. Heat olive oil in a large stock pot or dutch oven over medium-high heat.\n2. Add onion and cook until onion becomes translucent and begins to brown, about 3-5 minutes.\n3. Add garlic, ginger, and jalapeño. Continue to cook over medium heat until garlic is fragrant and jalapeño is tender, about 3-4 minutes.\n4. Add garam masala, turmeric, salt, and pepper then continue to cook for 1-2 minutes.\n5. Add tomatoes, chickpeas, and water. Stir to incorporate, making sure to use the spoon the scrape off any brown bits that have appeared on the bottom or sides of the pot.\n6. As the tomatoes break down, the mixture should take on the texture of a thick stew. Add more water if needed before bringing everything to a simmer and then cover with a lid.\n7. Once covered, cook for 15 minutes while stirring occasionally.\n8. Remove lid, reduce heat to low and mix in the lemon juice and chopped cilantro. Cook over low heat 1-2 minutes until the cilantro has wilted and turned bright green.\n9. Serve over basmati rice or with a side of naan.\n10.Enjoy!"],[822,"2 boneless, skinless chicken breasts\n6 cloves garlic, 4 minced, 2 smashed\n2 whole cloves\n2 tomatoes\n5 chipotle peppers in adobo sauce\n½ cup chicken stock (120 mL)\n2 teaspoons cumin\n½ teaspoon nutmeg\n2 tablespoons vegetable oil\n2 white onions, halved and sliced\n¼ lb chorizo (115 g)\n1 head iceberg lettuce, shredded\nkosher salt\nblack pepper, freshly ground\n2 avocados, sliced\n12 corn tortillas","1. Place chicken in a saucepan over medium heat with enough water to cover by 1 inch (3 cm).\n2. Add the smashed garlic and cloves. Simmer until the chicken is cooked through, 12-15 minutes.\n3. Remove the chicken from the pot, cool slightly, then shred with two forks.\n4. Place a cast-iron skillet over medium-high heat, until smoking.\n5. Add the tomatoes and roll slowly around until blackened on all sides, about 6 minutes.\n6. Add the seared tomatoes to a blender with chipotle peppers, chicken stock, cumin, and nutmeg. Blend until smooth.\n7. Heat the vegetable oil in a large pot over medium-high heat. Add the garlic, onions, and chorizo. Cook 2-3 minutes until the onions have softened and the chorizo has rendered a little fat.\n8. Add the lettuce and sauté 2-3 additional minutes, until softened.\n9. Add the tomato-chili mixture and cook for 3 minutes, stirring constantly to incorporate.\n10. Add the shredded chicken and bring mixture to a simmer. Simmer, uncovered, until most of the liquid has cooked off, about 10-15 minutes. Season with salt and pepper to taste.\n11. Serve on warm corn tortillas with sliced avocado.\n12. Enjoy!"],[823,"null","null"],[901,"3 Tomatos\n1/2 cup Olives\n1 teaspoon Garlic\n1 tablespoon Fresh Lemon Juice\n3 sprigs Thyme\n1/3 cup Fresh Basil, chopped\n2 teaspoons Dill\n1 teaspoon Chili Garlic Sauce\n1 Pepper Diced\n1 pound Skinless Filet of Sea Bass\n1 teaspoon Extra Virgin Olive Oil\n1/2 teaspoon Kosher Salt\n1/2 teaspoon Ground Black Pepper","1. Dice Tomatoes and Pepper into 1/4 inch segments and discard seeds.\n2. Chop and add Olives.\n3. Wash and dry: Basil, Thyme, and Dill.\n4. Finely chop basil, thyme, and dill, and add 1 clove of garlic to herb mixture.\n5. Toss ingredients in shallow bowl and add lemon juice, garlic chili sauce, and let stand together.\n6. Prep Sea Bass by patting the fish down with a paper towel to reduce excess moisture.\n7. Brush both sides of the filet with extra virgin olive oil, sprinkle with salt and pepper.\n8. Heat grill, and place fish on direct heat for 10-12 minutes depending on the thickness of the fish.\n9. Return fish to warm plate and top with salsa."],[902,"8 oz skin-on salmon (225 g), 4 fillets\nfine sea salt\nfreshly ground black pepper\n2 lemons","1. Heat a grill to medium-high heat.\n2. Season the salmon with salt and pepper.\n3. Brush the grill grates with oil and place the salmon, skin side down on the oiled grates.\n4. Grill until lightly browned, 3-5 minutes, then gently flip and continue to cook until just opaque in center.\n5. Add the lemon halves to the grill, cut side down and grill until lightly charred, about 2 minutes.\n6. Enjoy!"],[903,"CABBAGE SLAW\n½ head green cabbage, finely shredded\n½ medium red onion, small diced\n2 roma tomatoes, diced\n¼ cup fresh cilantro (10 g), chopped\n1 small jalapeño, diced\n2 tablespoons lime juice\nsalt, to taste\n\nCRISPY FISH\n1 cup all-purpose flour (125 g)\n1 tablespoon old bay seasoning\n½ teaspoon baking powder\n1 cup lager beer (240 mL)\nvegetable oil, for frying\n1 lb fresh cod (455 g), cut into 1-inch (2-cm) thick strips\n\nAVOCADO CREMA\n2 medium avocados\n1 cup sour cream (230 g)\n¼ cup lime juice (60 mL)\nsalt, to taste\n\nASSEMBLY\ncorn tortilla, warmed\nradish, thinly sliced, for serving, optional","1. Make the cabbage slaw: Combine the cabbage, onion, tomato, cilantro, jalapeño, lime juice, and salt in a large bowl. Toss well, then set aside.\n2. Make the crispy fish: In a large bowl, combine the flour, Old Bay, and baking powder. Add the beer and whisk until smooth. Let sit for 15 minutes.\n3. Heat the vegetable oil in a large pot until it reaches 350°F (180°C).\n4. Coat the fish in the batter, then transfer to the oil and fry until golden on the outside and cooked through, 5-7 minutes. Drain the fish on a wire rack set over a baking sheet lined with paper towels.\n5. Make the avocado crema: Add the avocados, sour cream, lime juice, and salt to a blender and blend until smooth.\n6. To assemble the tacos, add a bit of the cabbage slaw to a warmed tortilla. Top with a piece of fried fish, avocado crema, and sliced radish.\n7. Enjoy!"],[904,"1 yellow onion\n5 shallots \n2 carrots \n4 large tomatoes \n2 stalks celery \n2 cloves garlic\n4 lobsters \n5 tablespoons canola oil \n1 quart shrimp stock\n2 cups brandy \n15 medium Yukon gold potatoes, cut into 1-inch chunks \nSalt and pepper\n2 cups vermouth \n1/4 cup cognac \n1 bunch fresh tarragon \n1 cup heavy cream","1. Peel the onion, shallots and carrots and cut into small chunks.\n2. Cut the tomatoes and celery into similar sizes.\n3. Peel the garlic cloves and roughly chop.\n4. Break down the lobsters and cut the heads in half; keep the roe in to add flavor.\n5. Add 2 tablespoons oil to a large, high-sided skillet over medium-high heat and allow the oil to heat.\n6. Add the lobsters, onions, carrots and half of the celery to the skillet and saute until the onions start to become translucent, about 10 minutes.\n7. Add stock to cover and bring to a boil, then lower to a simmer.\n8. Add the brandy, cook for 5 minutes, then strain the stock and set aside the lobster pieces with flesh inside.\n9. Remove meat from lobster shells and chop into 1-inch chunks.\n10. Heat 2 tablespoons oil in a large skillet over high heat. \n11. Toss the potatoes with salt and pepper and add to the skillet.\n12. Flip occasionally to avoid burning and remove once they are par-cooked, about 8 minutes. Set aside.\n13. Heat remaining tablespoon oil in a large skillet over medium-high heat, then add the shallots and remaining celery and saute until translucent, about 5 minutes.\n14. Add the garlic and cook until fragrant, 2 more minutes. \n15. Add the tomatoes, potatoes and lobster, season with salt and pepper and cook until the tomatoes start to break down. \n16. Flambe with vermouth and cognac. Once the fire dies down, stir in the tarragon and heavy cream."],[905,"1 kg lobster\n600 g tomatoes\n60 g onion\n20 g chives\n100 ml vinegar\n50 g lemon\n35 ml olive oil\n12 g salt\n6 g pepper","1. Dip the lobster in a pot of boiling salted water and cooking it for about 20 minutes.\n2. After this time, turn off the flame and let it cool down inside the cooking water.\n3. Meanwhile, chop the onions and let them soak in vinegar for 10 minutes, then wash and peel the tomatoes and cut them into small pieces.\n4. When the lobster has cooled down, drain it.\n5. Cut the lobster lengthwise and remove the flesh by cutting it into pieces.\n6. Place it on a plate together with the onions and the cherry tomatoes.\n7. Season with a sauce previously prepared with oil, lemon juice, salt, and pepper.\n8. Once seasoned, let your lobster rest for a few minutes and then serve it, garnishing with blades of chives."],[906,"null","null"],[907,"null","null"],[908,"null","null"],[909,"null","null"],[910,"1 tbsp olive oil\n2 onions, finely sliced\nthumb-sized piece of ginger, grated\n½ tbsp turmeric\n1 tbsp garam masala\n½ tsp cayenne\n325ml light coconut milk\n400g boneless and skinless cod loin, cut into chunks\n300g frozen peas\n300g sugar snap peas\n400g brown basmati rice, cooked\n1 red chilli, finely sliced\n1 lime, cut into wedges","1. Heat the oil in a large saucepan over a medium heat, then fry the onion for 8 mins until translucent.\n2. Stir in the ginger and spices, and cook for another minute. \nPour in the coconut milk and 100ml water, stir, then simmer for 10 mins.\n3. Add the cod, frozen peas and sugar snap peas, and simmer for 5 mins until the fish is flaky.\n4. Serve with the rice, sliced chilli, a good grinding of black pepper and some lime wedges on the side for squeezing over."],[911,"null","null"],[912,"null","null"],[913,"null","null"],[914,"3 to 4 chicken backs\n1 dozen large crabs\n1 pouch crab boil mix\n1 tablespoon salt and pepper\n6 ounces tomato paste\n1 pint canned chopped tomatoes\n2 medium onions, diced\n2 medium green peppers, diced\n2 cups celery stalks, diced\n4 cups chopped okra, more to taste\n8 to 10 garlic cloves, finely chopped\n1 1/2 cups shortening\n2 cups all-purpose flour, or as needed\n3 tablespoons granulated sugar\n4 pounds raw shrimp, peeled, more to taste\n1 pint shucked oysters\n1 pint picked, cooked crab meat\n2 teaspoons gumbo filé powder","1. In a large stock pot, place in the chicken backs and crabs. \n2. Cover with 1 1/2 gallons of water.\n3. Add the crab boil mix and salt and pepper.\n4. Bring mixture to a boil, lower heat, and stir in tomato paste and canned tomatoes.\n5. Stir to dissolve the tomato paste. Add chopped vegetables and garlic to this mixture and continue to simmer while you prepare the roux.\n6. In a large skillet, heat the shortening. When hot, adjust flame to medium-low.\n7. Stir flour into shortening gradually, adding small amounts at a time and stirring constantly to mix in.\n8. Use enough flour to take up the grease. Continue to brown the flour until it is a deep dark brown color.\n9. Just before the roux reaches the ideal color, add in the sugar, cook and stir until the mixture becomes hard and hangs together when you lift spoon. Let cool slightly.\n10. Add roux to the liquid crab mixture, stirring to mix well. \n11. Let it come to a boil, then lower the heat and add the shrimp, oysters, and crab meat.\n12. Let this mixture cook for about 10 minutes. Adjust salt and seasonings, if necessary, then adjust heat so that the pot is simmering and add the filé. Let gumbo simmer on very low heat  until ready to serve.\n13. Serve in bowls over hot cooked rice."],[915,"1 small shallot, finely chopped\n2 tablespoons fresh parsley, finely chopped\n1 tablespoon fresh chives, finely chopped\n1 egg\n2 tablespoons mayonnaise\n2 teaspoons dijon mustard\n2 teaspoons fresh lemon juice\n½ teaspoon worcestershire sauce\n1 pinch cayenne pepper, optional\n1 lb fresh lump crab meat (455 g), picked over\nfine sea salt\nfreshly ground black pepper\n1 cup panko breadcrumbs (50 g)\n2 tablespoons all purpose flour, for dusing\n2 tablespoons unsalted butter\ntartar sauce, recipe follows\nlemon wedge","1. In a large bowl, whisk together the shallot, parsley, chives, egg, mayonnaise, Dijon mustard, lemon juice, Worcestershire sauce, and cayenne if using.\n2. Add the crabmeat, season with salt and pepper and stir to combine.\n3. Add the breadcrumbs and mix just to combine.\n4. Form into 6 equal patties and place on a plate. Chill in the refrigerator for at least 15 minutes, up to 1 hour.\n5. Coat the cakes lightly with flour, and shake off any excess.\n6. In a large skillet set over medium heat, melt the butter.\n7. Fry the crab cakes until golden and crisp, 3-4 minutes per side. Transfer to a paper towel-lined plate to drain slightly.\n8. Serve warm with tartar sauce and lemon wedges.\n9. Enjoy!"],[916,"1 lb large shrimp (455 g), peeled and deveined\n3 cloves garlic, minced\n2 cups broccoli floret (500 g)\n½ onion, diced\n1 tablespoon low sodium soy sauce\n2 tablespoons sesame oil, divided\n½ teaspoon salt, divided","1. Heat 1 tablespoon of sesame oil in a large, nonstick skillet over medium heat.\n2. Pour in the shrimp and season with ¼ teaspoon of the salt.\n3. Fry the shrimp for 1 minute on each side.\n4. Remove the shrimp from the pan and pour in the remaining 1 tablespoon of oil.\n5. Toss in the onion and remaining ¼ teaspoon of salt and sauté for a few minutes until they begin to soften.\n6. Add in the broccoli, garlic and soy sauce and sauté until the garlic is fragrant, about 30 seconds.\n7. Toss the shrimp back into the pan and mix until everything is well incorporated and the shrimp is fully cooked, about 1 minute.\n8. Divide the mixture evenly between 4 bowls.\n9. Enjoy!"],[917,"2 cups short grain rice (400 g)\n5 chicken breasts, medium-sized\n4 cups hot chicken broth (960 mL)\n½ cup chorizo crumbles (95 g)\n12 jumbo shrimps\n1 tablespoon olive oil\n⅓ cup onion (50 g), diced\n⅓ cup diced tomato (65 g)\n1 teaspoon smoked paprika\n1 teaspoon salt\n1 teaspoon pepper\n1 teaspoon garlic powder\n1 small bay leaf\n1 pinch saffron\nfresh cilantro, as garnish","1. Heat 1 tbsp olive oil in a skillet over medium heat. Then, saute chorizo crumbles and set aside.\n2. In the same pan, brown chicken and set aside once cooked through and golden brown.\n3. In the same pan (without draining the oil), add onions and tomatoes and sprinkle smoked paprika. Saute until translucent.\n4. Next, add short grain rice, chicken broth, small bay leaf, salt, pepper, garlic powder, and saffron. Mix well.\n5. Once broth reduces by half, add chicken atop rice and layer with sliced red peppers. Cover pot, reduce heat to low, and cook for 20 minutes.\n6. Then, add shrimp into the pan, cover, and cook until pink.\n7. Serve warm, garnished with cilantro and lemon."],[101,"25g butter\n2 tbsp olive oil\n3 garlic cloves, finely chopped\n1 red chilli, seeds left in and finely chopped\n½ tsp sweet paprika\n12-20 large raw king prawns with shells\njuice 1 lemon, plus a few slices for a finger bowl\n½ x small bunch parsley, roughly chopped\nsmall loaf crusty bread, warmed to serve","1. Melt the butter and oil together in a frying pan. \n2. Add the garlic, chilli and paprika, then fry for 1-2 mins until starting to turn golden.\n3. Turn up the heat, throw in the prawns and fry for a few mins, stirring, until all the prawns turn pink.\n4. Take off the heat, season and stir in the lemon juice and parsley.\n5. Add some lemon slices to a finger bowl of warm water, grab a bowl for the shells, then dig straight in with your fingers and hunks of crusty bread."],[102,"null","null"],[103,"1 cup plain flour\n1 cup cornflour\n2 eggs, beaten lightly\n1 1/2 cup (375ml) water\n1 cup packaged breadcrumbs\n500 gram mozzarella\nvegetable oil, for deep-frying\n1/3 cup sun-dried tomato pesto\n2/3 cup sweet chilli sauce","1. Whisk flour, cornflour, egg and the water in medium bowl until smooth, place breadcrumbs in small bowl.\n2. Cut cheese into 1cm-wide fingers.\n3. Dip cheese sticks, one at a time, in batter, then in breadcrumbs to coat.\n4. Dip cheese sticks, one at a time, back in batter, then in breadcrumbs to double-coat.\n5. Heat oil in large saucepan, deep-fry cheese sticks, in batches, until golden brown, drain on absorbent paper.\n6. Make the chilli pesto dipping sauce.\n7. Combine pesto and sauce in small bowl.\n8. Serve hot with chilli pesto dipping sauce."],[104,"1/2 cup smooth peanut butter\n1 tbsp peanut or vegetable oil\n2 cups julienned Chinese barbecued pork\n10 cups shredded green cabbage (about 1 large cabbage), blanched, squeezed dry in a dish towel\n1/2 cup chopped green onions\n2 tsp sugar\n2 tsp salt\n1/2 tsp freshly ground pepper\n1/4 tsp cinnamon","1. Mix the pork, the cabbage, the onions, the sugar, the salt, the pepper, the cinnamon, and any of the extra ingredients, if desired, in a large bowl.\n2. Warm the peanut butter over low heat until pourable. Add a tablespoon of peanut oil if necessary to get the right texture. Wait until it cools a bit, then pour it into the bowl with ingredients and mix until well combined.\n3. Slice off 1-inch from the corners of each wrapper. Stack the wrappers, then place them in front of you, so that a corner is pointing towards you.\n4. Place ¼ cup of the filling near the corner closest to you, then roll upwards. When you reach the middle part of the wrapper, fold the sides inward, and continue rolling until there are only 2 inches of the wrapper remaining. Brush with egg white and seal. \n5. Fry the rolls in batches, in 350°F oil or lard, until golden. Transfer on paper towel-lined plates to drain.\n6. Serve hot, with a side of either, duck sauce, sweet and sour sauce, or hot mustard for dipping."],[105,"null","null"],[106,"1 pound dried chickpeas\n6 cloves of garlic, crushed and roughly minced\n1 medium yellow onion, quartered and roughly chopped\n3/4 cup parsley leaves, chopped\n3/4 cup cilantro, chopped\n1 1/2 teaspoons ground coriander\n1 tablespoon ground cumin\n1 teaspoon cayenne pepper\n1 1/2 teaspoons kosher salt\n3/4 teaspoon freshly ground black pepper\n1 teaspoon baking soda\n2 tablespoons freshly squeezed lemon juice\n1 tablespoon lemon zest\nNeutral-tasting oil, for frying","1. Place chickpeas in a large pot and cover with several inches of water.Bring to a simmer, turn off the heat, give the chickpeas a stir, and let sit at least overnight.\n2. Remove some of the cooking liquid from the chickpeas and reserve. Drain them well, then place in a bowl of a large food processor.\n3. To the chickpeas, add the garlic, onion, parsley, and cilantro. In a small bowl, stir together the coriander, cumin, cayenne, salt, pepper, and baking soda, then add it to the chickpeas along with the lemon juice and zest.\n4. Pulse the whole mixture several times until the chickpeas are broken down and resemble chopped nuts. Scrape down the sides of the food processor, then re-pulse as necessary.\n5. If the mixture is too dry to hold together when pressed, add some of the reserved liquid, a little at a time. Pour the mixture into a large bowl and give it a few good stirs to make sure everything is incorporated.\n6. Scoop up the mixture in rounded tablespoons, roll into balls, and flatten slightly. Set aside on a baking sheet.\n7. Heat at least 2 inches of oil in a large, deep stockpot over medium-high heat.\n8. When the oil reaches about 350º F, carefully slip in several of the falafel, making sure not to crowd the pan. Fry the falafel until they reach a deep golden brown -- it should only take a few minutes.\n9. When they're done, transfer them onto paper towels to drain. Repeat with the rest of the falafel. Serve hot or at room temperature."],[107,"null","null"],[108,"2 medium tomatoes (300g), seeded, chopped finely\n1/2 small red onion (50g), chopped finely\n1 clove garlic, crushed\n1 tablespoon red wine vinegar\n2 tablespoon olive oil\n4 slice sourdough bread (280g)\ncooking-oil spray\n2 tablespoon finely shredded fresh basil","1. Preheat oven to 220°C/425°F.\n2. Combine tomato, onion, garlic, vinegar and oil in small bowl.\n3. Stand 20 minutes.\n4. Meanwhile, place bread on oiled oven tray, spray with cooking oil. \n5. Toast, in oven (or under grill), until browned both sides.\n6. Stir basil into tomato mixture, spoon onto toasted bread."],[109,"null","null"],[110,"1 package frozen puff pastry\n3/4 cup grated, aged goat cheese\n8 ounces soft-ripened goat cheese\n1 bunch asparagus\nFreshly ground pepper and sea salt, to taste","1. Preheat your oven to 400 °F.\n2. Piece together two rectangles of puff pastry by overlapping them. Roll up the edges until they're about 1/2 inch high.\n3. Sprinkle the aged goat cheese over the puff pastry in a thin layer.\n4. Halve the soft-rind goat cheese log, and then slice lengthwise into 1 inch strips. Layer on the strips intermittently in three rows.\n5. Snap the asparagus into shorter pieces when necessary.\n6. Bake for 20 to 25 minutes, until puff pastry is golden.\n7. Serve hot or at room temperature."],[111,"400g pack frozen pollock fillets, thawed, dried and roughly chopped\n1 egg\n1 tbsp red Thai curry paste\n2 tsp fish sauce\n1 tbsp cornflour\nzest and juice 1 lime\n50g green beans, trimmed and finely sliced\n2 tbsp sunflower oil, for frying\n3 tbsp sweet chilli dipping sauce","1. Tip the fish into a food processor with the egg, curry paste, fish sauce and cornflour, then blitz until smooth. \n2. Tip the mixture into a bowl and stir in the lime zest and green beans, then shape into 8 fish cakes.\n3. Heat a little oil in a large non-stick frying pan, then cook the fish cakes for a couple of mins each side until firm and cooked through.\n4. While the fish cakes are cooking, stir the lime juice into the chilli sauce to make a dressing. \n5. Pile salad onto plates, top with the fish cakes and drizzle with a little dressing."],[112,"null","null"],[113,"null","null"],[114,"85g cornflour\n85g plain flour\n2 tsp black pepper, cracked\n2 tbsp ground Szechuan peppercorns, roughly crushed\nsunflower or vegetable oil, for frying\n400g squid, cleaned and cut into strips\nfinely sliced spring onion and green chilli, to serve\n1 red chilli, finely chopped\nhalf cucumber, finely diced\n1 small red onion, finely chopped\n100ml rice wine vinegar\n1 tbsp caster sugar\n2 tsp fish sauce","1. To make the dipping sauce, mix all the ingredients in a small bowl until the sugar has dissolved, then set aside. \n2. Mix the cornflour and plain flour with both peppers and 2 tsp sea salt in a large bowl, then set aside.\n3. Line a tray with kitchen paper and make sure you have more salt to sprinkle with.\n4. Heat about 7cm of oil to 180C in a deep fryer, wok or deep pan. \n5. Coat the squid well with the flour mix and fry in batches for about 2 mins each or until crisp. \n6. Use a slotted spoon to lift out the squid, then drain on the kitchen paper and sprinkle with a little more salt. \n7. Serve the squid scattered with the spring onion and chilli, with the dipping sauce on the side."],[115,"1 lb sea scallop (455 g), side muscles removed\nfine sea salt\nblack pepper, freshly ground\n1 tablespoon extra virgin olive oil\n2 tablespoons unsalted butter, cut into small pieces\n1 clove garlic, grated\n1 tablespoon dry white wine\n2 tablespoons fresh chives, finely chopped","1. Pat the scallops dry with a paper towel.\n2. Season with salt and pepper.\n3. In a large skillet set over medium-high heat, add the oil.\n4. When the oil is hot, add the scallops and cook until golden brown on one side, 2-3 minutes.\n5. Gently turn the scallops, and add the butter and garlic to the pan.\n6. Continue to cook, spooning the butter over the scallops until they are cooked through, about 3 minutes more.\n7. Add the white wine, cook another 10 seconds.\n8. Serve with chives.\n9. Enjoy!"],[116,"2 cups dry white wine\n1/2 cup Minced Shallots\n8 sprigs Fresh tarragon minced\n1/4 Fresh thymes\n1/8 tablespoon Fresh cracked black pepper\n5 tablespoons Butter\n7 quarts Mussels scrubbed, and soaked\n2 tablespoons Chili pepper crushed\n1/2 cup Fresh parsley diced\n2 splashes White truffle oil","1. Bring all but the last three ingredients to boil in the kettle. Boil for 2 to 3 minutes to evaporate its alcohol and to reduce its volume slightly.\n2. Add the mussels to the kettle. Cover tightly and boil quickly over high heat.\n3. In about 5 minutes, the shells will swing open and the mussels are done.\n4. With a big skimmer, dip the mussels into wide soup places.\n5. Allow the cooking liquid to settle for a moment so any sand will sink to the bottom.\n6. Then ladle the liquid over the mussels, sprinkle with the parsley and splash of white truffle oil, serve immediately."],[117,"null","null"],[118,"12 thin slices of smoked salmon\n2 green apples, peeled and cored\nRed peppercorns\nFresh dill\n1 lemon\n2 Chicory heads\n1 cup yoghurt\n3 teaspoons Dijon mustard\n3 teaspoons honey\n2 teaspoons grated fresh ginger\n1 tablespoon fresh dill removed from stalk\nExtra dill for decorating\n1/2 cup Greek yoghurt for decorating","1. Sauce Put all the ingredients in a bowl and mix very well.\n2. Dice the peeled and cored apple in very small cubes, about 0.2 inches. Add them immediately to the sauce and toss to coat.\n3. Cut the slices of salmon in strips.\n4. Finger food version Put some apple tartare in a leaf, add some cut up smoked salmon on top, a teaspoon of plain Greek yoghurt and a small sprig of dill. Add a wedge of lemon, red peppercorns and serve."],[119,"null","null"],[120,"null","null"],[121,"null","null"],[122,"null","null"],[123,"1 cup shredded carrots\n3 cups broccoli florets\n1 garlic clove\n2 eggs\n1 1/4 cups seasoned breadcrumbs, divided\n3/4 cup shredded cheddar cheese\n1/2 teaspoon onion powder\n1/2 teaspoon black pepper\n1 tablespoon canola oil","1. Shred carrots.\n2. Steam broccoli in the microwave for two minutes or until tender.\n3. Place shredded carrots, steamed broccoli, garlic, eggs,1 cup of the breadcrumbs, cheese, onion powder, and black pepper in food processor and pulse for 15 seconds or until well combined. \n4. Form mixture into balls, about a tablespoon each \n5. Place remaining 1/4 cup breadcrumbs in a shallow dish. Coat each veggie nuggets with breadcrumbs.\n6. Heat oil in a skillet on medium high heat until it sizzles when sprinkled with water droplets.\n7. Arrange nuggets in skillet and cook about 4 minutes each side, or until golden brown and crispy. \n8. Serve with honey-mustard sauce, ketchup, or other favorite dip."],[124,"1 small shallot, finely chopped\n2 tablespoons fresh parsley, finely chopped\n1 tablespoon fresh chives, finely chopped\n1 egg\n2 tablespoons mayonnaise\n2 teaspoons dijon mustard\n2 teaspoons fresh lemon juice\n½ teaspoon worcestershire sauce\n1 pinch cayenne pepper, optional\n1 lb fresh lump crab meat (455 g), picked over\nfine sea salt\nfreshly ground black pepper\n1 cup panko breadcrumbs (50 g)\n2 tablespoons all purpose flour, for dusing\n2 tablespoons unsalted butter","1. In a large bowl, whisk together the shallot, parsley, chives, egg, mayonnaise, Dijon mustard, lemon juice, Worcestershire sauce, and cayenne if using.\n2. Add the crabmeat, season with salt and pepper and stir to combine.\n3. Add the breadcrumbs and mix just to combine.\n4. Form into 6 equal patties and place on a plate. Chill in the refrigerator for at least 15 minutes, up to 1 hour.\n5. Coat the cakes lightly with flour, and shake off any excess.\n6. In a large skillet set over medium heat, melt the butter.\n7. Fry the crab cakes until golden and crisp, 3-4 minutes per side. Transfer to a paper towel-lined plate to drain slightly.\n8. Enjoy!"],[125,"null","null"],[126,"4 cups mixed olives\n2 sprigs thyme\nPeel of 1 orange\n1 tablespoon toasted coriander seeds\n1/2 tablespoon toasted cumin seeds\n1 small dried chili, crumbled\n1/4 cup extra-virgin olive oil","1. Mix the spices and the olives together and cover with olive oil.\n2. Let macerate at room temperature for a minimum of one hour.\n3. These olives will also keep for at least week in the fridge."],[127,"null","null"],[128,"1 cup flour (125 g)\n1 teaspoon chili powder\n1 teaspoon kosher salt\n1 teaspoon black pepper, freshly ground\n1 teaspoon paprika\n1 teaspoon garlic powder\n20 chicken wings, or drumettes\n1 cup BBQ sauce (290 g)","1. In a bowl, combine flour, chili powder, salt, pepper, paprika, and garlic powder. Coat the wings in the flour evenly, shaking off any excess.\n2. Place the floured wings on a parchment paper–lined baking sheet and spread them out in a single layer.\n3. Bake for 45 minutes, flipping halfway through, until skin is crispy and golden brown.\n4. In a separate bowl, combine the BBQ sauce. Stir the cooked wings in the sauce and coat them evenly.\n5. Place the coated wings back onto the baking sheet and spread them in a single layer.\n6. Bake for 8 to 10 minutes, until sauce is bubbly and caramelized. Cool, then serve.\n7. Enjoy!"],[129,"2 kg game meat (deer or wild boar) boneless\n2 shallots\n1 carrot\n12 juniper berries\n1 l dry white wine\n3 tbsp of Armagnac\n1 bouquet garni\n2 slices of bacon\n350 g sausage meat\n200 g ground veal\nsalt\npepper","1. Cut the game meat into thin strips. Peel and chop the shallots. Peel the carrot and cut into slices. Crush 12 juniper berries.\n2. Put the meat in a terrine mold with the spices, berries, and root vegetables. Add the white wine, three tablespoons of Armagnac and bouquet garni. Stir and leave to marinate for 24 hours in a cool place.\n3. The next day, first, preheat the oven to 180°C. Drain the pieces of meat and pat them dry.\n4. Spread a slice of bacon in the bottom of a terrine mold, Cover with strips of game meat, then a layer of sausage meat and veal. Add salt and pepper. Place the second slice of bacon on top to seal.\n5. Cover the terrine with a lid, place it in a water bath, and cook in the oven for two hours. After cooking, remove the lid and allow to cool.\n6. Serve cold the next day as a starter."],[130,"null","null"],[131,"null","null"],[132,"null","null"],[133,"null","null"],[134,"null","null"],[135,"null","null"],[136,"null","null"],[137,"null","null"],[138,"DOUGH\n1 cup warm water (235 mL)\n2 tablespoons olive oil\n2 tablespoons honey\n2 teaspoons salt\n3 ⅓ cups flour (415 g)\n1 ½ teaspoons yeast\n\nTOPPINGS\n2 tablespoons extra virgin olive oil\n2 sprigs fresh rosemary, leaves removed\nsalt, to taste\npepper, to taste","1. Combine water, olive oil, honey, salt, flour, and yeast in a large bowl.\n2. Mix well and knead for 10-15 minutes until the dough is elastic.\nTransfer the dough into a well-oiled bowl.\n3. Cover with a towel or plastic wrap and let rise once for 1 hour in a warm place, until the dough has doubled.\n4. Remove the dough from the bowl and stretch the dough into 9-inch (23 cm) circle.\n5. Place the dough into well greased 10-inch (25 cm) cast iron pan. Cover with towel or plastic wrap and rest for 30 minutes.\n6. Poke the top with your fingertips.\n7. Drizzle with olive oil and sprinkle with rosemary, salt, and pepper.\n8. Bake in the oven for 20-30 minutes.\n9. Slice and serve.\n10. Enjoy!"],[139,"null","null"],[140,"null","null"],[141,"null","null"],[142,"null","null"],[143,"1 tablespoon vegetable oil\n1 medium_piece brown onion, finely chopped\n3 slice white bread\n350 gram (11 ounces) sausage mince\n350 gram (11 ounces) minced (ground) beef\n1 tablespoon tomato paste\n1 teaspoon dried mixed herbs\n2 tablespoon fresh flat-leaf parsley, finely chopped","1. Heat vegetable oil in small frying pan, cook finely chopped brown onion. \n2. Cut crusts off 3 slices white bread.\n3. Discard crusts.\n4. Dip bread in small bowl of cold water, remove immediately.\n5. Combine onion and bread in large bowl with sausage mince, ground beef, tomato paste, dried mixed herbs and finely chopped fresh flat-leaf parsley.\n6. Preheat oven to 220°C.\n7. Lightly oil two oven trays.\n8. Cut 4 sheets puff pastry in half lengthways.\n9. Place equal amounts of mixture lengthways along centre of each pastry piece, roll each pastry piece, from one wide edge, to enclose filling. \n10. Place four rolls, seam-side down, on each of the prepared trays; brush with lightly beaten egg. Sprinkle with sesame seeds, cut each roll into eight pieces.\n11. Bake, uncovered, about 15 minutes."],[144,"null","null"],[145,"null","null"],[146,"null","null"],[147,"null","null"],[148,"null","null"],[149,"null","null"],[150,"12 mini sausages\n6 rashers bacon\n1 cup grated mozzarella cheese (100 g)\n1 sheet puff pastry\negg wash, as needed\n2 tablespoons black onion seed, to taste","1. Cut the rashers in half lengthwise, and roll the sausages in them. Set aside.\n2. Lay out the sheet of puff pastry and coat with some egg wash.\nCut into 12 squares.\n3. In each square, sprinkle on some cheese, followed by a sausage wrapped in bacon.\n4. Roll in the pastry. Pierce some holes on top of each roll and coat with more egg wash. Top with black onion seeds.\n5. Bake for 20 minutes, or until golden brown and the sausages are cooked through.\n6. Enjoy!"],[201,"6 large mild onions\n100g flour\n1/4 cup cream\npepper\nsalt\n3 eggs\n1/4 lb parmesan cheese\nlard, for frying\nmelted butter with mustard, for serving","1. Peel the onions, remove their top and bottom, and cut them into 1/2-inch-thick slices.\n2. Prepare the batter by mixing flour, cream, salt, pepper, and eggs for 10 minutes.\n3. Grate the parmesan cheese finely and add it to the batter. Mix well.\n4. Heat lard for frying in a large pan.\n5. Dip the onions in the batter so they are fully covered. Take them out using a fork, and fry in lard until they are brown and crispy.\n6. Drain the onion rings on a paper towel.\n7. Serve hot, with some melted butter with mustard."],[202,"null","null"],[203,"null","null"],[204,"null","null"],[205,"3 cups stone-ground cornmeal\n2 tsp kosher salt\n2 tsp baking powder\n3/4 tsp baking soda\n3 tsp sugar (optional)\n2 ½ cups buttermilk\n3 eggs\n1 ½ sticks of unsalted butter, melted, divided","1. Set the oven to preheat to 375°F, then place a well-seasoned, 12-inch cast iron skilled on the middle rack of the oven.\n2. Next, add cornmeal, salt, baking powder, baking soda, and sugar if you’re using it to a large bowl, then whisk to combine.\n3. Take a separate bowl, add to it buttermilk and eggs and while continuously whisking, drizzle in all of the melted butter in, except for one tablespoon.\n4. Pour the liquid ingredients into the dry ones, and whisk just until combined. Don’t overmix, a few lumps here and there are perfectly fine.\n5. Add the remaining tablespoon of melted to the now preheated skillet, swirling the skillet, so the bottom and the sides are coated. Scrape the batter into the skillet, and use a rubber spatula to smooth the top.\n6. Place in the preheated oven and bake for 45 minutes or until the top turn lightly brown and a skewer inserted into the center comes out clean.\n7. When done, leave the cornbread to cool in the skillet for 15 minutes, then serve while still warm."],[206,"1/2 cup plain low-fat yogurt\n1/4 cup mayonnaise\n3 tablespoons apple cider vinegar\n1 tablespoon honey\n1 teaspoon kosher salt\n1/4 teaspoon freshly ground black pepper\n8 cups very thinly sliced green cabbage (from 1 medium cabbage)\n1/2 cup coarsely grated carrot (1 medium carrot)\n1/4 cup thinly sliced red onion","1. In a large bowl, whisk together the yogurt, mayonnaise, vinegar, honey, salt and pepper.\n2. Add the cabbage, carrot, onion and toss well to combine.\n3. Cover and refrigerate for at least 30 minutes and up to overnight, so the cabbage softens a bit. \n4. Toss well before serving."],[207,"null","null"],[208,"null","null"],[209,"null","null"],[210,"null","null"],[211,"null","null"],[212,"null","null"],[213,"null","null"],[214,"null","null"],[215,"null","null"],[216,"null","null"],[217,"null","null"],[218,"null","null"],[219,"null","null"],[220,"375 gram small shell pasta\n1/4 cup fresh oregano, coarsely chopped\n1/2 cup (125ml) olive oil\n1/4 cup (60ml) lemon juice\n3 cup (480g) shredded cooked chicken\n1 medium_piece (170g) red onion, sliced thinly\n500 gram cherry tomatoes, quartered\n2 (260g) cucumbers, chopped coarsely\n1 large_piece (350g) green capsicum, chopped coarsely\n1 cup (120g) seeded kalamata olives\n280 gram jar marinated artichoke hearts, drained, chopped coarsely\n200 gram fetta cheese, chopped coarsely","1. Cook pasta in large saucepan of boiling water, uncovered, until just tender, drain. Rinse under cold water, drain.\n2. Meanwhile, place 2 tablespoons of the oregano, oil and juice in a screw-top jar, shake well.\n3. Place pasta in large bowl with chicken, onion, tomato, cucumber, capsicum, olives, artichoke, cheese and dressing, toss gently to combine.\n4. Top salad with remaining oregano."],[221,"cooking-oil spray\n2 (1kg) eggplants, cut into 1cm slices\n2 (440g) tomatoes, finely chopped\n1 cup coarsely chopped fresh flat-leaf parsley\n1/2 cup (140g) low-fat natural yoghurt\n2 tablespoon water\n1 tablespoon mint sauce\n1 tablespoon finely chopped fresh mint","1. Spray heated barbecue grill plate (or grill or barbecue) with cooking-oil spray.\n2. Cook eggplant, about 2 minutes each side, until tender.\n3. Make mint yoghurt dressing by combining yoghurt, water, mint sauce and mint in a small bowl.\n4. Divide eggplant, tomato and parsley among plates; drizzle with dressing."],[222,"16-20 asparagus spears\n2 tbsp sesame oil\n1 tbsp soy sauce\n1 garlic clove, crushed\n2 tbsp sesame seeds","1. Place 4 or 5 asparagus stalks next to one another. \n2. Skewer them crosswise in two places – just below the tips and 3cm from the bottom – with slender bamboo skewers. \n3. In a small bowl, combine the sesame oil, soy sauce, garlic and sesame seeds and stir with a fork to mix.Brush this mixture on the asparagus rafts on both sides. \n4. Season the asparagus with a little salt and lots of pepper.\n5. Grill the asparagus on a barbecue or in a griddle pan for 4-5 mins per side, turning with tongs. \n6. Sprinkle with sesame mix as they grill."],[223,"null","null"],[224,"null","null"],[225,"null","null"],[226,"null","null"],[227,"null","null"],[228,"null","null"],[229,"null","null"],[230,"25g butter\n1 small onion, finely chopped\n2 tbsp plain flour\n200ml full-fat milk\n2 x 200g bags spinach\n100ml single cream\nfresh nutmeg, for grating","1. Heat the butter in a saucepan, then add the onion and cook for 5 mins until softened. \n2. Stir in the flour and cook for 2 mins, then slowly start to whisk in the milk. \n3. When it has all been incorporated, gently cook for 5 mins until the sauce has thickened.\n4. Place the spinach in a large colander.\n5. Pour over a kettle full of boiling water until the leaves have wilted.\n6. Place the spinach in a clean dishcloth, squeeze out any excess liquid, then roughly chop. \n7. Stir into the sauce with the cream, gently heat, then finely grate over some nutmeg and season well."],[231,"null","null"],[232,"null","null"],[233,"null","null"],[234,"null","null"],[235,"null","null"],[236,"null","null"],[237,"null","null"],[238,"null","null"],[239,"null","null"],[240,"null","null"],[301,"null","null"],[302,"2 (400g) medium potatoes, coarsely chopped\n2 (240g) medium carrots, coarsely chopped\n1 (200g) large brown onion, coarsely chopped\n1 (150g) medium tomato, coarsely chopped\n1 (150g) stalk celery, trimmed, coarsely chopped\n6 cup (1.5l) water\n1 tablespoon olive oil\n50 gram butter\n4 (800g) medium potatoes, extra, coarsely chopped\n1 (500g) large leek, thickly sliced\n300 millilitre cream\n2 tablespoon finely chopped fresh chives\n1 tablespoon finely chopped fresh basil\n1 tablespoon finely chopped fresh dill","1. In large saucepan, bring potato, carrot, onion, tomato, celery and the water to the boil. Reduce heat, simmer, uncovered, 20 minutes.\n2. Strain broth through muslin-lined sieve or colander into large heatproof bowl, set aside solids.\n3. In same cleaned pan, heat oil and butter.\n4. Cook extra potato and leek, covered, 15 minutes, stirring occasionally.\n5. Add broth, bring to the boil.\n6. Reduce heat, simmer, covered, 15 minutes.\n7. Cool 15 minutes.\n8. Blend or process soup, in batches, until smooth.\n9. Return soup to same cleaned pan.\n10. Add cream, stir over medium heat until hot.\n11. Serve bowls of soup sprinkled with combined herbs and croutons if desired."],[303,"null","null"],[304,"null","null"],[305,"null","null"],[306,"2 tablespoons olive oil\n1 large onion, diced\n2 ribs celery, diced (1/2 cup)\n1 large carrot, scrubbed well, then diced\n1 medium red bell pepper, seeded and diced\n1 medium zucchini (about 8 ounces), diced\n4 cloves garlic, minced\n1 teaspoon dried oregano\n1 teaspoon dried basil\n1 teaspoon kosher salt\n1/2 teaspoon freshly ground black pepper\n28 ounces canned, no-salt-added crushed tomatoes\n48 ounces (6 cups) no-salt-added vegetable broth or chicken broth\n15 ounces canned, no-salt-added small red beans, drained and rinsed\n1/2 cup dried, whole-grain elbow pasta\n1/3 cup freshly grated Parmigiano-Reggiano cheese, for garnish","1. Heat the oil in a large soup pot over medium heat. \n2. Once the oil shimmers, add the onion, celery, carrot and bell pepper; cook for about 6 minutes, stirring occasionally, until they begin to soften.\n3. Add the zucchini, garlic, oregano, basil, salt and pepper, cook, stirring, for 2 minutes. \n4. Add the tomatoes and broth, bring to a boil, then reduce the heat to medium-low.\n5. Partially cover and cook for 10 minutes, stirring once or twice, then add the beans and pasta.\n6. Increase the heat to medium-high just long enough to return the soup to a boil, then reduce the heat to medium-low and cook uncovered for 10 to 15 minutes, until the pasta and vegetables are tender.\n7. Garnish each portion with the cheese."],[307,"null","null"],[308,"null","null"],[309,"null","null"],[310,"null","null"],[311,"1 lb lean ground beef (454 g)\n1 small onion, chopped\n15 oz canned kidney bean (425 g), 1 can\n15 oz canned black bean (425 g), 1 can\n15 oz canned corn kernels (425 g), 1 can\n15 oz canned diced tomato (425 g), 1 can\n8 oz tomato sauce (225 g), 1 can\n2 tablespoons taco seasoning\n1 shredded cheddar cheese, to serve\n1 sour cream, to serve\n1 pico de gallo, to serve\n1 avocado, sliced, to serve\n1 tortilla chip, to serve\n1 lime wedge, to serve\n1 chopped cilantro, to serve","1. Add the ground beef and onion to a large pot and stir until the beef is cooked through.\n2. Drain excess liquid.\n3. Add the kidney beans, black beans, corn, tomatoes, tomato sauce, and taco seasoning to the pot, and stir until combined.\n4. Cook over medium heat for 10 minutes.\n5. Serve with cheddar cheese, sour cream, pico de gallo, avocado, corn chips, lime wedges, and cilantro.\n6. Enjoy!"],[312,"null","null"],[313,"1 tablespoon olive oil\n1 large onion, chopped (about 2 cups)\n2 cloves garlic, minced (about 2 teaspoons)\nOne 2 ½-pound butternut squash, peeled, seeded, and cut into 1-inch cubes\n6 cups low-sodium chicken or vegetable broth\n½ teaspoon salt, plus more to taste\n2 tablespoons honey\n4 teaspoons plain nonfat yogurt, for garnish","1. Heat the oil over medium heat in a large soup pot. \n2. Add the onion and garlic and cook, stirring until softened, about 5 minutes. \n3. Add the squash, broth and salt and bring to a boil. \n4. Reduce the heat to a medium-low and simmer until the squash is tender, about 15 minutes. \n5. Remove the soup from the heat, stir in the honey, and puree until smooth in the pot using an immersion blender or in two batches in a regular blender. \n6. Taste and season with salt, if necessary.\n7. Ladle the soup into serving bowls and drizzle with the yogurt"],[314,"null","null"],[315,"null","null"],[316,"null","null"],[317,"1 kilogram pumpkin, peeled and chopped\n1 large potato, peeled and chopped\n1 large onion, finely chopped\n1 clove garlic, finely chopped\n4 cups water\n3 teaspoons vegetable (or chicken) stock powder\n1 tin spiced tomatoes","1. Add onion and garlic to pot with a little oil. Fry until onion is cooked.\n2. Add pumpkin, potato, water and stock powder.\n3. Bring to the boil and simmer for about 15 to 20 minutes or until vegetables are very soft and mushy.\n4. Remove soup from heat.\n5. Add tomatoes.\n6. Puree soup with stick blender, mash with a potato masher, or blend in a food processor.\n7. If necessary, reheat before serving.\n8. Serve with toasted wholegrain bread."],[318,"null","null"],[319,"null","null"],[320,"null","null"],[321,"null","null"],[322,"null","null"],[323,"null","null"],[324,"null","null"],[325,"null","null"],[326,"null","null"],[327,"null","null"],[328,"null","null"],[329,"null","null"],[330,"null","null"],[331,"null","null"],[332,"null","null"],[401,"null","null"],[402,"null","null"],[403,"null","null"],[404,"null","null"],[405,"null","null"],[406,"null","null"],[407,"null","null"],[408,"null","null"],[409,"PASTRY DOUGH\n2 ½ cups (300g) all-purpose flour, plus extra for work surface\n2 tbsp granulated sugar\n1 tsp kosher or sea salt\n18 tbsp (2-1/4 sticks) chilled unsalted butter, cut into small cubes\n6-8 tbsp ice water\n\nFILLING\n5 cups (1 kg) fresh wild blueberries\n3 tbsp flour\n1/2 cup (100g) sugar\n1/2-1 tsp lemon juice\n1 ½ tbsp butter\n1 egg, beaten, for glaze","1. First, prepare the pastry for the pie. In a medium-sized bowl, add flour, salt, and sugar, then mix until combined. Next, add butter, and using your fingers, rub it in into the flour mixture until it starts looking like breadcrumbs.\n2. Add six tablespoons of ice water and stir using a fork until it forms into a dough.\n3. Transfer to a lightly floured surface and knead only three times, then gather into a ball. Divide the dough into two pieces, a slightly larger and a smaller piece.\n4. Flatten each piece into a disk, then wrap in cling film and refrigerate for 30 minutes.\n5. To make the pie, first, set the oven to preheat to 400°F/200°C.\n6. Toss the blueberries with flour, sugar, and lemon juice and set aside.\n7. Take a large piece of the pastry dough, place it between two sheets of baking paper, and roll it out into a 13-inch (33cm) circle.\n8. Remove the top sheet of baking paper from the dough, place the dough paper-free side down into a 9-inch (23cm) deep-dish pie pan, then remove the remaining baking paper.\n9. Press the dough into the pie pan and leave any excess dough to overhang.\n10. Repeat the same with the smaller disk of dough, only roll it to an 11-inch (28cm) circle, and leave aside for later.\n11. Pour the berries into the pie crust and top with pieces of butter.\n12. Take the smaller circle of dough, remove the baking paper, and place the baking paper side on top, then also peel off that remaining sheet of baking paper.\n13. With a knife, make three slits in the top crust for steam to escape.\n14. Next, fold the bottom pie crust over the top and crimp together at the edges to seal.\n15. Glaze with an egg wash.\n16. Bake for 45-50 minutes."],[410,"null","null"],[411,"null","null"],[412,"1 (9-inch/23cm) unbaked or frozen deep-dish pie crust\n1 cup (330g) corn syrup\n3 eggs\n1 cup (200g) sugar\n2 tbsp butter, melted\n1 ½ cup (190g) pecans\n1 tsp vanilla extract","1. Set the oven to preheat to 350°F/180°C. Lightly coat the pie pan with oil and place the pie crust.\n2. Next, combine corn syrup, eggs, sugar, butter, and vanilla, then add the pecans.\n3. Pour the filling into the pie crust and bake in the oven for 60 to 70 minutes.\n4. Once baked, cool for two hours before serving."],[413,"null","null"],[414,"null","null"],[415,"null","null"],[416,"null","null"],[417,"null","null"],[418,"null","null"],[419,"null","null"],[420,"null","null"],[421,"null","null"],[422,"1 tablespoon vanilla extract\n1 can sweetened condensed milk\n2 cans evaporated milk\n2 cups white sugar\n4 eggs\n whole milk\n salt\n ice\n fruit (optional)","1. With an electric mixer, cream eggs and sugar.\n2. Add evaporated milk, condensed milk, and vanilla. Beat well. \n3. Pour into an electric ice cream churn. \n4. Add whole milk to fill line. Insert dasher.\n5. Pack cooler 1/3 full with ice. Add a layer of rock salt. Repeat layering with ice and salt until full.\n6. Note: be careful not to overfill, spilling salt into the churn. \n7. When machine starts to labor or shut off, remove the dasher and drain water. \n8. Fill with more ice and salt. \n9. Cover with a towel and let harden. Makes about 1 gallon."],[423,"null","null"],[424,"null","null"],[425,"null","null"],[426,"null","null"],[427,"null","null"],[428,"null","null"],[501,"null","null"],[502,"null","null"],[503,"null","null"],[504,"null","null"],[505,"null","null"],[506,"null","null"],[507,"null","null"],[508,"null","null"],[509,"null","null"],[510,"null","null"],[1501,"null","null"],[1502,"null","null"],[1503,"null","null"],[1504,"null","null"],[1505,"null","null"],[1506,"null","null"],[1507,"null","null"],[1508,"null","null"],[1509,"null","null"],[1510,"null","null"],[2501,"null","null"],[2502,"null","null"],[2503,"null","null"],[2504,"null","null"],[2505,"null","null"],[2506,"null","null"],[2507,"null","null"],[2508,"null","null"],[2509,"null","null"],[2510,"null","null"]]]],0,0,[],[],[]]
